schplay/ESP32-AIC3212/src/ESP32_AIC3212.cpp
/*
    ESP32_AIC3212

    Purpose: I2C control library for the TLV320AIC3212 audio codec on ESP32

    License: MIT License.  Use at your own risk.
 */

#include "ESP32_AIC3212.h"

namespace esp32aic3212
{

// Software Reset
#define AIC3212_SOFTWARE_RESET_BOOK 0x00
#define AIC3212_SOFTWARE_RESET_PAGE 0x00
#define AIC3212_SOFTWARE_RESET_REG 0x01
#define AIC3212_SOFTWARE_RESET_INITIATE 0x01

//******************* INPUT DEFINITIONS *****************************//
#define AIC3212_MICPGA_PAGE                             0x01
#define AIC3212_MICPGA_LEFT_POSITIVE_REG                0x34
#define AIC3212_MICPGA_RIGHT_POSITIVE_REG               0x37
#define AIC3212_MICPGA_LEFT_NEGATIVE_REG                0x36
#define AIC3212_MICPGA_RIGHT_NEGATIVE_REG               0x39
#define AIC3212_MICPGA_LEFT_VOLUME_REG                  0x3B
#define AIC3212_MICPGA_RIGHT_VOLUME_REG                 0x3C
#define AIC3212_MICPGA_VOLUME_ENABLE                    0b00000000

#define AIC3212_MIC_ROUTING_POSITIVE_IN1                0b11000000
#define AIC3212_MIC_ROUTING_POSITIVE_IN2                0b00110000
#define AIC3212_MIC_ROUTING_POSITIVE_IN3                0b00001100
#define AIC3212_MIC_ROUTING_POSITIVE_REVERSE            0b00000011

#define AIC3212_MIC_ROUTING_NEGATIVE_CM_TO_CM1L         0b11000000
#define AIC3212_MIC_ROUTING_NEGATIVE_IN2_REVERSE        0b00110000
#define AIC3212_MIC_ROUTING_NEGATIVE_IN3_REVERSE        0b00001100
#define AIC3212_MIC_ROUTING_NEGATIVE_CM_TO_CM2L         0b00000011

#define AIC3212_MIC_ROUTING_RESISTANCE_10k              0b01010101
#define AIC3212_MIC_ROUTING_RESISTANCE_20k              0b10101010
#define AIC3212_MIC_ROUTING_RESISTANCE_40k              0b11111111
#define AIC3212_MIC_ROUTING_RESISTANCE_DEFAULT          AIC3212_MIC_ROUTING_RESISTANCE_10k

// Mic Bias
#define AIC3212_MIC_BIAS_PAGE                       0x01
#define AIC3212_MIC_BIAS_REG                        0x33
#define AIC3212_MIC_BIAS_EXT_MASK                   0b11110000
#define AIC3212_MIC_BIAS_EXT_MANUAL_POWER           0b10000000
#define AIC3212_MIC_BIAS_EXT_POWER_ON               0b01000000
#define AIC3212_MIC_BIAS_EXT_POWER_OFF              0b00000000
#define AIC3212_MIC_BIAS_EXT_OUTPUT_VOLTAGE_1_62    0b00000000
#define AIC3212_MIC_BIAS_EXT_OUTPUT_VOLTAGE_2_4     0b00010000
#define AIC3212_MIC_BIAS_EXT_OUTPUT_VOLTAGE_3_0     0x00100000
#define AIC3212_MIC_BIAS_EXT_OUTPUT_VOLTAGE_3_3     0x00110000

#define AIC3212_MIC_BIAS_MASK                       0b00001111
#define AIC3212_MIC_BIAS_MANUAL_POWER               0b00001000
#define AIC3212_MIC_BIAS_POWER_ON                   0b00000100
#define AIC3212_MIC_BIAS_POWER_OFF                  0b00000000
#define AIC3212_MIC_BIAS_OUTPUT_VOLTAGE_1_62        0b00000000
#define AIC3212_MIC_BIAS_OUTPUT_VOLTAGE_2_4         0b00000001
#define AIC3212_MIC_BIAS_OUTPUT_VOLTAGE_3_0         0x00000010
#define AIC3212_MIC_BIAS_OUTPUT_VOLTAGE_3_3         0x00000011

// ADC Processing Block
#define AIC3212_ADC_PROCESSING_BLOCK_PAGE 0x00
#define AIC3212_ADC_PROCESSING_BLOCK_REG 0x3d

// ADC power & digital mic configuration
#define AIC3212_ADC_CHANNEL_POWER_PAGE 0x00
#define AIC3212_ADC_CHANNEL_POWER_REG 0x51
#define AIC3212_ADC_CHANNEL_POWER_REG_PWR_MASK 0b11000000
#define AIC3212_ADC_CHANNELS_ON 0b11000000

#define AIC3212_ADC_CHANNEL_POWER_REG_L_DIG_MIC_MASK 0b00111100
#define AIC3212_ADC_LEFT_CONFIGURE_FOR_DIG_MIC 0b00010000
#define AIC3212_ADC_RIGHT_CONFIGURE_FOR_DIG_MIC 0b00000100

// Mute the ADC
#define AIC3212_ADC_MUTE_PAGE 0x00
#define AIC3212_ADC_MUTE_REG 0x52
#define AIC3212_ADC_UNMUTE 0b00000000
#define AIC3212_ADC_MUTE 0b10001000

// ADC filter coefficients
#define AIC3212_ADC_IIR_FILTER_BOOK 0x28
#define AIC3212_ADC_IIR_FILTER_LEFT_PAGE 0x01
#define AIC3212_ADC_IIR_FILTER_RIGHT_PAGE 0x02

// ADC Digital Volume Control
#define AIC3212_ADC_VOLUME_BOOK 0x00
#define AIC3212_ADC_VOLUME_PAGE 0x00
#define AIC3212_ADC_VOLUME_LEFT_REGISTER 0x53
#define AIC3212_ADC_VOLUME_RIGHT_REGISTER 0x54
#define AIC3212_ADC_VOLUME_MIN ( (int8_t) -12 )
#define AIC3212_ADC_VOLUME_MAX ( (int8_t) 20 )
#define AIC3212_ADC_VOLUME_MASK 0x7F

// DAC volume registers
#define AIC3212_DAC_VOLUME_PAGE 0x00
#define AIC3212_DAC_VOLUME_LEFT_REG 0x41
#define AIC3212_DAC_VOLUME_RIGHT_REG 0x42

// Headphone volume
#define AIC3212_HP_VOLUME_PAGE 0x01
#define AIC3212_HPL_VOLUME_REG 0x1F
#define AIC3212_HPR_VOLUME_REG 0x20
#define AIC3212_HP_VOLUME_MASK 0b00111111
#define AIC3212_HP_VOLUME_MIN (int8_t)-6
#define AIC3212_HP_VOLUME_MAX (int8_t)14

// Speaker volume
#define AIC3212_SPKR_VOLUME_PAGE 0x01
#define AIC3212_SPKR_VOLUME_REG 0x30

// PDM control
#define AIC3212_BCLK2_PIN_CTRL_PAGE 0x04
#define AIC3212_BCLK2_PIN_CTRL_REG 0x46
#define AIC3212_BCLK2_DISABLED 0b00000000
#define AIC3212_BCLK2_ENABLE_PDM_CLK 0b00101000

#define AIC3212_DIN2_PIN_CTRL_PAGE 0x04
#define AIC3212_DIN2_PIN_CTRL_REG 0x48
#define AIC3212_DIN2_DISABLED 0b00000000
#define AIC3212_DIN2_ENABLED 0b00100000

#define AIC3212_GPI1_PIN_CTRL_PAGE              0x04
#define AIC3212_GPI1_PIN_CTRL_REG               0x5B

#define AIC3212_GPIO2_PIN_CTRL_PAGE             0x04
#define AIC3212_GPIO2_PIN_CTRL_REG              0x57

#define AIC3212_DIGITAL_MIC_SETTING_PAGE 0x04
#define AIC3212_DIGITAL_MIC_SETTING_REG 0x65
#define AIC3212_DIGITAL_MIC_DIN2_LEFT_RIGHT 0b00000011

#define AIC3212_ADC_POWERTUNE_PAGE 0x01
#define AIC3212_ADC_POWERTUNE_REG 0x3D

// Default configuration for 48kHz sample rate using PLL
// BCLK = 48kHz × 64 = 3.072 MHz (32-bit stereo I2S frames)
// PLL_OUT = BCLK × 12 = 36.864 MHz
// DAC_CLK = PLL_OUT / NDAC / MDAC = 36864kHz / 3 / 4 = 3072 kHz
// Sample Rate = DAC_CLK / DOSR = 3072kHz / 64 = 48,000 Hz
const Config DefaultConfig{
    .i2s_bits = I2S_Word_Length::I2S_32_BITS,  // Match ESP32 I2S config (32-bit)
    .i2s_clk_dir = I2S_Clock_Dir::AIC_INPUT,
    .pll = {
        .range = PLL_Clock_Range::LOW_RANGE,
        .src = PLL_Source::BCLK1,  // Use BCLK1 (3.072 MHz) as PLL input
        .r = 1,
        .j = 12,
        .d = 0,  // PLL_OUT = (3.072MHz / 1) * 12 = 36.864 MHz
        .p = 1,
        .clkin_div = 1,
        .enabled = true},  // PLL ENABLED for ADC clock generation
    .dac = {.clk_src = ADC_DAC_Clock_Source::PLL_CLK,  // Use PLL (36.864 MHz) — required for PRB_P1 RC=8 constraint
            .ndac = 3,  // 36.864MHz / (3×4×64×48kHz) = 36.864MHz ✓
            .mdac = 4,  // MDAC×DOSR/32 = 4×64/32 = 8 = PRB_P1 RC requirement ✓
            .dosr = 64,  // DOSR×fs = 64×48kHz = 3.072MHz ✓ (within 2.8–6.2MHz range per SLAU360)
            .prb_p = 1,  // PRB_P1: 3 BiQuads → Interp. Filter A → volume control → output (slau360)
            .ptm_p = DAC_PowerTune_Mode::PTM_P1},  // PTM_P1: best linearity/SNR for low-impedance loads (8Ω speaker, ≤64Ω headphones)
    .adc = {.clk_src = ADC_DAC_Clock_Source::PLL_CLK,  // Use PLL (36.864 MHz) for ADC
            .nadc = 1,
            .madc = 12,  // MADC=12 satisfies PRB_R7 constraint: MADC×AOSR/32=24 (≥23 required)
            .aosr = 64,  // Optimized for Decimation Filter B
            .prb_r = 7,  // PRB_R7: Decimation Filter B - full audio bandwidth (0-21.6kHz @ 48kHz)
            .ptm_r = ADC_PowerTune_Mode::PTM_R4}
            // ADC_MOD_CLK = 36.864MHz / (1×12) = 3.072 MHz (optimal for CMM-3424DT-26165-TR)
            // Sample rate = 36.864MHz / (1×12×64) = 48 kHz
            // Passband: 0-0.45×Fs = 0-21.6 kHz (vs PRB_R13: 0-5.3 kHz at 48kHz)
};

// helper functions
uint8_t getAudioConnInput(InputChannel_s inputChan) 
{
    uint8_t audioConn = 0;
    if (inputChan.aicId == Aic_Id_2) audioConn += 2;
    if (inputChan.sideChan == Right_Chan) audioConn += 1;
    return audioConn;
}

