schplay/ESP32-AIC3212/src/ESP32_AIC3212.cpp
uint8_t getAudioConnOutput(OutputChannel_s outputChan) 
{
    uint8_t audioConn = 0;
    if (outputChan.aicId == Aic_Id_2) audioConn += 2;
    if (outputChan.sideChan == Right_Chan) audioConn += 1;
    return audioConn;
}

void ESP32AIC3212::setI2Cbus(int i2cBusIndex)
{
    if (myWire) { delete myWire; myWire = nullptr; }
    switch (i2cBusIndex)
    {
    case 0:
        myWire = new TwoWireWrapper(&Wire);
        break;
    case 1:
#ifdef Wire1
        myWire = new TwoWireWrapper(&Wire1);
#else
        myWire = new TwoWireWrapper(&Wire);
#endif
        break;
    case 2:
#ifdef Wire2
        myWire = new TwoWireWrapper(&Wire2);
#else
        myWire = new TwoWireWrapper(&Wire);
#endif
        break;
    default:
        myWire = new TwoWireWrapper(&Wire);
        break;
    }
}

bool ESP32AIC3212::enable(void)
{
    // Hardware reset handled by sketch before calling enable()
    aic_reset();
    delay(3);  // TI App Guide shows a 1 msec delay
    aic_init();

    aic_goToBook(0);
    aic_readPage(0, 27);

    if (debugToSerial) Serial.println("# AIC3212 enable done");
    return true;
}

bool ESP32AIC3212::inputSelect(int left, int right)
{     
    if (debugToSerial) Serial.println("# ESP32AIC3212: inputSelect");
    
    uint8_t errFlag = false;
    
    uint8_t
        b0_p0_r81 = 0x00,   // Power down left and right ADC channel, clear Digital Mic config
        b0_p0_r82 = 0x88,   // Mute ADC Fine Gain Volume
        b0_p1_r52 = 0,      // Left Mic PGA disconnected
        b0_p1_r54 = 0,      // Left Mic PGA disconnected
        b0_p1_r55 = 0,      // Right Mic PGA disconnected
        b0_p1_r57 = 0,      // Right Mic PGA disconnected
        b0_p1_r59 = 0x80,   // Mute Left MICPGA Volume
        b0_p1_r60 = 0x80,   // Mute Right MICPGA Volume
        b0_p4_r87 = 0,      // GPIO2 disabled
        b0_p4_r91 = 0,      // GPI1 disabled
        b0_p4_r101 = 0b00000000; // Left and Right DIN Both on GPI1 (B0_P4_R101)


    // LEFT
    if ( (left == Aic_Input_In1) || (left == Aic_Input_In2) || (left == Aic_Input_In3) )
    {
        b0_p1_r54 = 0b01000000;
        b0_p1_r59 = 0x00;
        b0_p0_r81 |= 0b10000000;
        b0_p0_r82 &= 0x7F;
    }
    else if (left == Aic_Input_Pdm)
    {
        b0_p0_r81 |= 0b10010000;
        b0_p0_r82 &= 0x7F;
    }

    // RIGHT
    if ( (right == Aic_Input_In1) || (right == Aic_Input_In2) || (right == Aic_Input_In3) )
    {
        b0_p1_r57 = 0b01000000;
        b0_p1_r60 = 0x00;
        b0_p0_r81 |= 0b01000000;
        b0_p0_r82 &= 0xF7;
    }
    else if (right == Aic_Input_Pdm)
    {
        b0_p0_r81 |= 0b01000100;
        b0_p0_r82 &= 0xF7;
    }

    // LEFT routing
    switch(left)
    {
        case Aic_Input_In1:
            b0_p1_r52 = (AIC3212_MIC_ROUTING_POSITIVE_IN1 & AIC3212_MIC_ROUTING_RESISTANCE_10k);
            break;
        case Aic_Input_In2:
            b0_p1_r52 = (AIC3212_MIC_ROUTING_POSITIVE_IN2 & AIC3212_MIC_ROUTING_RESISTANCE_10k);
            break;
        case Aic_Input_In3:
            b0_p1_r52 = (AIC3212_MIC_ROUTING_POSITIVE_IN3 & AIC3212_MIC_ROUTING_RESISTANCE_10k);
            break;
        case Aic_Input_Pdm:
            b0_p4_r87 = 0b00101000;
            b0_p4_r91 = 0b00000010;
            b0_p4_r101 = 0b00000000;
            break;
        case Aic_Input_None:
        default:
            break;
    }

    // RIGHT routing
    switch(right)
    {
        case Aic_Input_In1:
            b0_p1_r55 = (AIC3212_MIC_ROUTING_POSITIVE_IN1 & AIC3212_MIC_ROUTING_RESISTANCE_10k);
            break;
        case Aic_Input_In2:
            b0_p1_r55 = (AIC3212_MIC_ROUTING_POSITIVE_IN2 & AIC3212_MIC_ROUTING_RESISTANCE_10k);
            break;
        case Aic_Input_In3:
            b0_p1_r55 = (AIC3212_MIC_ROUTING_POSITIVE_IN3 & AIC3212_MIC_ROUTING_RESISTANCE_10k);
            break;
        case Aic_Input_Pdm:
            b0_p4_r87 = 0b00101000;
            b0_p4_r91 = 0b00000010;
            b0_p4_r101 = 0b00000000;
            break;
        case Aic_Input_None:
        default:
            break;
    }

    // -- Write Registers --
    aic_goToBook(0);

    errFlag &= aic_writePage(AIC3212_MICPGA_PAGE, AIC3212_MICPGA_LEFT_POSITIVE_REG, b0_p1_r52);
    errFlag &= aic_writePage(AIC3212_MICPGA_PAGE, AIC3212_MICPGA_LEFT_NEGATIVE_REG, b0_p1_r54);
    errFlag &= aic_writePage(AIC3212_MICPGA_PAGE, AIC3212_MICPGA_LEFT_VOLUME_REG, b0_p1_r59);

    errFlag &= aic_writePage(AIC3212_MICPGA_PAGE, AIC3212_MICPGA_RIGHT_POSITIVE_REG, b0_p1_r55);
    errFlag &= aic_writePage(AIC3212_MICPGA_PAGE, AIC3212_MICPGA_RIGHT_NEGATIVE_REG, b0_p1_r57);
    errFlag &= aic_writePage(AIC3212_MICPGA_PAGE, AIC3212_MICPGA_RIGHT_VOLUME_REG, b0_p1_r60);

    errFlag &= aic_writePage(AIC3212_GPIO2_PIN_CTRL_PAGE, AIC3212_GPIO2_PIN_CTRL_REG, b0_p4_r87);
    errFlag &= aic_writePage(AIC3212_GPI1_PIN_CTRL_PAGE, AIC3212_GPI1_PIN_CTRL_REG, b0_p4_r91);  
    errFlag &= aic_writePage(AIC3212_DIGITAL_MIC_SETTING_PAGE, AIC3212_DIGITAL_MIC_SETTING_REG, b0_p4_r101); 

    errFlag &= aic_writePage(AIC3212_ADC_CHANNEL_POWER_PAGE, AIC3212_ADC_CHANNEL_POWER_REG, b0_p0_r81);   //Power up ADC and set digital mic input (if selected)
    errFlag &= aic_writePage(AIC3212_ADC_CHANNEL_POWER_PAGE, AIC3212_ADC_MUTE_REG, b0_p0_r82);   //Unmute Fine Gain

    if (errFlag == 0) {
        return true;
    } else {
        Serial.println("ESP32AIC3212: ERROR: Unable to write to Input Select Registers");
        return false;
    }
}

bool ESP32AIC3212::setMicBias(Mic_Bias biasSetting)
{
    uint8_t buffer = 0;
    bool errStatus = false;
        
    aic_goToBook(0);
    aic_goToPage(AIC3212_MIC_BIAS_PAGE);

    aic_readRegister(AIC3212_MIC_BIAS_REG, &buffer);
    buffer &= ~AIC3212_MIC_BIAS_MASK;

    if (biasSetting == Mic_Bias_Off)
    {
        buffer |= AIC3212_MIC_BIAS_POWER_OFF;
    }
    else
    {
        buffer |= (AIC3212_MIC_BIAS_POWER_ON | AIC3212_MIC_BIAS_MANUAL_POWER);

        if (biasSetting == Mic_Bias_1_62)
        {
            buffer |= AIC3212_MIC_BIAS_OUTPUT_VOLTAGE_1_62;
        }
        else if (biasSetting == Mic_Bias_2_4)
        {
            buffer |= AIC3212_MIC_BIAS_OUTPUT_VOLTAGE_2_4;
        }
        else if (biasSetting == Mic_Bias_3_0)
        {
            buffer |= AIC3212_MIC_BIAS_OUTPUT_VOLTAGE_3_0;
        }
        else if (biasSetting == Mic_Bias_3_3)
        {
            buffer |= AIC3212_MIC_BIAS_OUTPUT_VOLTAGE_3_3;
        }
        else
        {
            Serial.println("ESP32AIC3212: ERROR: Unable to set MIC BIAS - Value not supported: ");
        }
    }

    errStatus = aic_writeRegister(AIC3212_MIC_BIAS_REG, buffer);

