schplay/ESP32-AIC3212/src/ESP32_AIC3212.cpp
    if(errStatus==false)
    {
        Serial.println("ESP32AIC3212: ERROR: Unable to write to Mic Bias Register");
    }

    return errStatus;
}


 bool ESP32AIC3212::setMicBiasExt(Mic_Bias biasSetting)
 {
    uint8_t buffer = 0;
    bool errStatus = false;

    aic_goToBook(0);
    aic_goToPage(AIC3212_MIC_BIAS_PAGE);

    aic_readRegister(AIC3212_MIC_BIAS_REG, &buffer);
    buffer &= ~AIC3212_MIC_BIAS_EXT_MASK;

    if (biasSetting == Mic_Bias_Off)
    {
        buffer |= AIC3212_MIC_BIAS_EXT_POWER_OFF;
    }
    else
    {
        buffer |= (AIC3212_MIC_BIAS_EXT_POWER_ON | AIC3212_MIC_BIAS_EXT_MANUAL_POWER);

        if (biasSetting == Mic_Bias_1_62)
        {
            buffer |= AIC3212_MIC_BIAS_EXT_OUTPUT_VOLTAGE_1_62;
        }
        else if (biasSetting == Mic_Bias_2_4)
        {
            buffer |= AIC3212_MIC_BIAS_EXT_OUTPUT_VOLTAGE_2_4;
        }
        else if (biasSetting == Mic_Bias_3_0)
        {
            buffer |= AIC3212_MIC_BIAS_EXT_OUTPUT_VOLTAGE_3_0;
        }
        else if (biasSetting == Mic_Bias_3_3)
        {
            buffer |= AIC3212_MIC_BIAS_EXT_OUTPUT_VOLTAGE_3_3;
        }
        else
        {
            Serial.println("ESP32AIC3212: ERROR: Unable to set MIC BIAS Ext- Value not supported: ");
        }
    }

    errStatus = aic_writeRegister(AIC3212_MIC_BIAS_REG, buffer);

    if(errStatus==false)
    {
        Serial.println("ESP32AIC3212: ERROR: Unable to write to Mic Bias Ext Register");
    }

    return errStatus;
 }

void ESP32AIC3212::aic_reset()
{
    if (debugToSerial)
    {
        Serial.println("# INFO: Resetting AIC3212");
        Serial.print("#   7-bit I2C address: 0x");
        Serial.println(static_cast<uint8_t>(i2cAddress), HEX);
    }
    aic_goToBook(AIC3212_SOFTWARE_RESET_BOOK);
    aic_writePage(AIC3212_SOFTWARE_RESET_PAGE, AIC3212_SOFTWARE_RESET_REG, AIC3212_SOFTWARE_RESET_INITIATE);

    delay(10);
}

float ESP32AIC3212::applyLimitsOnInputGainSetting(float gain_dB)
{
    if (gain_dB < 0.0) gain_dB = 0.0;
    if (gain_dB > 47.5) gain_dB = 47.5;
    return gain_dB;
}

float ESP32AIC3212::setInputGain_dB(float orig_gain_dB, int Ichan)
{
    float gain_dB = applyLimitsOnInputGainSetting(orig_gain_dB);
    if (abs(gain_dB - orig_gain_dB) > 0.01)
    {
        Serial.println("ESP32AIC3212: WARNING: Attempting to set input gain outside allowed range");
    }

    float volume = gain_dB * 2.0;
    int8_t volume_int = (int8_t)(round(volume));

    if (debugToSerial)
    {
        Serial.print("AIC3212: Setting Input volume to ");
        Serial.print(gain_dB, 1);
        Serial.print(".  Converted to volume map => ");
        Serial.println(volume_int);
    }

    aic_goToBook(0);
    if (Ichan == 0) {
        aic_writePage(AIC3212_MICPGA_PAGE, AIC3212_MICPGA_LEFT_VOLUME_REG, AIC3212_MICPGA_VOLUME_ENABLE | volume_int);
    } else {
        aic_writePage(AIC3212_MICPGA_PAGE, AIC3212_MICPGA_RIGHT_VOLUME_REG, AIC3212_MICPGA_VOLUME_ENABLE | volume_int);
    }
    return gain_dB;
}

float ESP32AIC3212::setInputGain_dB(float gain_dB)
{
    gain_dB = setInputGain_dB(gain_dB, 0); // left channel
    return setInputGain_dB(gain_dB, 1);    // right channel
}

// Sets digital volume within the ADC processing block; accepts -12~20dB in steps of 0.5
float ESP32AIC3212::setAdcVolume_dB(float vol_dB)
{
    vol_dB = constrain(vol_dB, AIC3212_ADC_VOLUME_MIN, AIC3212_ADC_VOLUME_MAX);
    vol_dB = roundf(2*vol_dB);

    aic_goToBook(AIC3212_ADC_VOLUME_BOOK);
    aic_writePage( AIC3212_ADC_VOLUME_PAGE, AIC3212_ADC_VOLUME_LEFT_REGISTER, AIC3212_ADC_VOLUME_MASK & (int8_t)vol_dB );
    aic_writePage( AIC3212_ADC_VOLUME_PAGE, AIC3212_ADC_VOLUME_RIGHT_REGISTER, AIC3212_ADC_VOLUME_MASK & (int8_t)vol_dB );

    return (vol_dB/2.0f);
}

//******************* OUTPUT  *****************************//
bool ESP32AIC3212::enableAutoMuteDAC(bool enable, uint8_t mute_delay_code)
{
    if (enable)
    {
        mute_delay_code = (uint8_t)constrain((int)mute_delay_code, 0, 7);
        if (mute_delay_code == 0) enable = false;
    }
    else
    {
        mute_delay_code = 0; // this disables the auto mute
    }
    aic_goToBook(0);
    uint8_t val = aic_readPage(0, 64);
    val = val & 0b10001111;             // clear these bits
    val = val | (mute_delay_code << 4); // set these bits
    aic_writePage(0, 64, val);
    return enable;
}

// -63.6 to +24 dB in 0.5dB steps.  uses signed 8-bit
float ESP32AIC3212::applyLimitsOnVolumeSetting(float vol_dB)
{
    if (vol_dB > 24.0) vol_dB = 24.0;
    if (vol_dB < -63.5) vol_dB = -63.5;
    return vol_dB;
}

float ESP32AIC3212::volume_dB(float orig_vol_dB, int Ichan)
{
    float vol_dB = applyLimitsOnVolumeSetting(orig_vol_dB);
    if (abs(vol_dB - orig_vol_dB) > 0.01)
    {
        Serial.println("ESP32AIC3212: WARNING: Attempting to set DAC Volume outside range");
    }
    int8_t volume_int = (int8_t)(round(vol_dB * 2.0));

    if (debugToSerial)
    {
        Serial.print("ESP32AIC3212: Setting DAC");
        Serial.print(Ichan);
        Serial.print(" volume to ");
        Serial.print(vol_dB, 1);
        Serial.print(".  Converted to volume map => ");
        Serial.println(volume_int);
    }

    aic_goToBook(0);
    if (Ichan == 0) {
        aic_writePage(AIC3212_DAC_VOLUME_PAGE, AIC3212_DAC_VOLUME_LEFT_REG, volume_int);
    } else {
        aic_writePage(AIC3212_DAC_VOLUME_PAGE, AIC3212_DAC_VOLUME_RIGHT_REG, volume_int);
    }
    return vol_dB;
}

float ESP32AIC3212::volume_dB(float vol_left_dB, float vol_right_dB)
{
    volume_dB(vol_right_dB, 1);
    return volume_dB(vol_left_dB, 0);
}

float ESP32AIC3212::volume_dB(float vol_dB)
{
    vol_dB = volume_dB(vol_dB, 1);
    return volume_dB(vol_dB, 0);
}

float ESP32AIC3212::get_volume_dB(int chan) {
    int8_t vol_int = -99;
    
    aic_goToBook(0);
    if (chan == 0) {
            vol_int = aic_readPage(AIC3212_DAC_VOLUME_PAGE, AIC3212_DAC_VOLUME_LEFT_REG);
    } else if (chan == 1) {
            vol_int = aic_readPage(AIC3212_DAC_VOLUME_PAGE, AIC3212_DAC_VOLUME_RIGHT_REG);
    } else {
        return -99.0;
    }
    
