schplay/ESP32-AIC3212/src/ESP32_AIC3212.cpp
    float vol_dB = -99.0;
    if (vol_int > -99) vol_dB = ((float)vol_int)/2.0f;
    return vol_dB;            
}

float ESP32AIC3212::setHeadphoneGain_dB(float gain_left_dB, float gain_right_dB)
{
    unsigned int buff = 0;
    int8_t left_dB_u8 = 0;
    int8_t right_dB_u8 = 0;

    left_dB_u8 = (int)(gain_left_dB + 0.5); 
    right_dB_u8 = (int)(gain_right_dB + 0.5); 

    left_dB_u8 = constrain(left_dB_u8, AIC3212_HP_VOLUME_MIN, AIC3212_HP_VOLUME_MAX);
    right_dB_u8 = constrain(right_dB_u8, AIC3212_HP_VOLUME_MIN, AIC3212_HP_VOLUME_MAX);

    if (gain_left_dB < -90.0) left_dB_u8 = 0b00111001; //mute it
    if (gain_right_dB < -90.0) right_dB_u8 = 0b00111001; //mute it

    aic_goToBook(0);
    buff = aic_readPage(AIC3212_HP_VOLUME_PAGE, AIC3212_HPL_VOLUME_REG); //read existing register value
    buff = (buff & (~AIC3212_HP_VOLUME_MASK)) | (left_dB_u8 & AIC3212_HP_VOLUME_MASK);
    aic_writePage( AIC3212_HP_VOLUME_PAGE, AIC3212_HPL_VOLUME_REG, uint8_t(buff) );

    buff = aic_readPage(AIC3212_HP_VOLUME_PAGE, AIC3212_HPR_VOLUME_REG); //read existing register value
    buff = (buff & (~AIC3212_HP_VOLUME_MASK)) | (right_dB_u8 & AIC3212_HP_VOLUME_MASK);
    aic_writePage( AIC3212_HP_VOLUME_PAGE, AIC3212_HPR_VOLUME_REG, uint8_t(buff) );
    
    return left_dB_u8;
}

float ESP32AIC3212::setSpeakerVolume_dB(float target_vol_dB)
{
    int int_targ_vol_dB = (int)(target_vol_dB + 0.5f);

    uint8_t val = 0x00;
    if (int_targ_vol_dB == 0) {
        val = 0x00;  // Mute (SPR disabled)
    } else if (int_targ_vol_dB == 6) {
        val = 0x11;
    } else if (int_targ_vol_dB == 12) {
        val = 0x22;
    } else if (int_targ_vol_dB == 18) {
        val = 0x33;
    } else if (int_targ_vol_dB == 24) {
        val = 0x44;
    } else if (int_targ_vol_dB == 30) {
        val = 0x55;
    }

    aic_goToBook(0);
    aic_writePage(1, 48, val);     // Speaker volume

    return (float)int_targ_vol_dB;
}

void ESP32AIC3212::setDACVolume_dB(float vol_dB)
{
    // DAC digital volume control (P0_R41/R42)
    // Range: -63.5dB to +24dB in 0.5dB steps
    // Format: signed 8-bit, 0x00 = 0dB, 0x01 = +0.5dB, 0xFF = -0.5dB
    int8_t vol_int = (int8_t)(vol_dB * 2.0f);  // Convert dB to 0.5dB steps

    aic_goToBook(0);
    aic_writePage(0, 0x41, (uint8_t)vol_int);  // Left DAC volume
    aic_writePage(0, 0x42, (uint8_t)vol_int);  // Right DAC volume
}

void ESP32AIC3212::writeBiquadCoefficients(void)
{
    // Helper lambda to scale and clamp coefficients to valid range
    auto scaleAndClamp = [](float b0, float b1, float b2, float a1, float a2,
                            int32_t& n0, int32_t& n1, int32_t& n2, int32_t& d1, int32_t& d2,
                            const char* filterName) {
        // Find maximum coefficient magnitude to determine if scaling is needed
        float abs_b0 = abs(b0);
        float abs_b1 = abs(b1) / 2.0;  // b1 has factor of 2
        float abs_b2 = abs(b2);
        float abs_a1 = abs(a1) / 2.0;  // a1 has factor of 2
        float abs_a2 = abs(a2);

        float max_b = abs_b0;
        if (abs_b1 > max_b) max_b = abs_b1;
        if (abs_b2 > max_b) max_b = abs_b2;

        float max_a = abs_a1;
        if (abs_a2 > max_a) max_a = abs_a2;

        float max_coeff = (max_b > max_a) ? max_b : max_a;

        // Scale factor to bring into range (leave 10% headroom)
        float scale = 1.0;
        if (max_coeff > 0.9) {
            scale = 0.9 / max_coeff;
            Serial.printf("    [%s] Scaling by %.3f to prevent overflow (max=%.3f)\n",
                         filterName, scale, max_coeff);
        }

        // Apply scaling and convert to fixed-point
        // Note: All coefficients stored as 24-bit signed values
        // AIC3212 denominator has MINUS signs: (2^23 - 2*D1*z^-1 - D2*z^-2)
        // So D1 = -a1 * 2^22 and D2 = -a2 * 2^23
        n0 = (int32_t)((b0 * scale) * 8388608.0);
        n1 = (int32_t)((b1 * scale) * 4194304.0);
        n2 = (int32_t)((b2 * scale) * 8388608.0);
        d1 = (int32_t)((-a1 * scale) * 4194304.0);  // NEGATE a1
        d2 = (int32_t)((-a2 * scale) * 8388608.0);  // NEGATE a2

        // Clamp ALL coefficients to 24-bit signed range
        n0 = constrain(n0, -8388607, 8388607);
        n1 = constrain(n1, -8388607, 8388607);
        n2 = constrain(n2, -8388607, 8388607);
        d1 = constrain(d1, -8388607, 8388607);
        d2 = constrain(d2, -8388607, 8388607);
    };

    // FILTER 1: 1st-order High-pass @ 20Hz (DC blocking only; preserves all audible content)
    Serial.println("  Filter 1: 1st-order High-pass @ 20Hz");

    float fc_hp = 20.0;
    float fs = 48000.0;
    float wc = 2.0 * M_PI * fc_hp / fs;
    float K = tan(wc / 2.0);

    // 1st-order high-pass Butterworth (b2=0, a2=0)
    float b0_hp = 1.0 / (1.0 + K);
    float b1_hp = -b0_hp;  // -1/(1+K)
    float b2_hp = 0.0;     // 1st-order: no z^-2 term
    float a1_hp = (K - 1.0) / (K + 1.0);
    float a2_hp = 0.0;     // 1st-order: no z^-2 term

    int32_t n0_1, n1_1, n2_1, d1_1, d2_1;
    scaleAndClamp(b0_hp, b1_hp, b2_hp, a1_hp, a2_hp, n0_1, n1_1, n2_1, d1_1, d2_1, "HPF");

    Serial.printf("    N0=0x%06X, N1=0x%06X, N2=0x%06X, D1=0x%06X, D2=0x%06X\n",
                  n0_1 & 0xFFFFFF, n1_1 & 0xFFFFFF, n2_1 & 0xFFFFFF,
                  d1_1 & 0xFFFFFF, d2_1 & 0xFFFFFF);

    // FILTER 2: Peaking @ 4500Hz, +6dB, BW=2000Hz → Q=2.25
    Serial.println("  Filter 2: Peaking @ 4500Hz, +6dB, Q=2.25");

    float fc_pk1 = 4500.0;
    float gain_pk1 = 6.0;  // dB
    float Q_pk1 = fc_pk1 / 2000.0;  // Q = fc / BW = 4500 / 2000 = 2.25

    float A_pk1 = pow(10.0, gain_pk1 / 40.0);
    float w0_pk1 = 2.0 * M_PI * fc_pk1 / fs;
    float alpha_pk1 = sin(w0_pk1) / (2.0 * Q_pk1);

    float b0_pk1 = 1.0 + alpha_pk1 * A_pk1;
    float b1_pk1 = -2.0 * cos(w0_pk1);
    float b2_pk1 = 1.0 - alpha_pk1 * A_pk1;
    float a0_pk1 = 1.0 + alpha_pk1 / A_pk1;
    float a1_pk1 = -2.0 * cos(w0_pk1);
    float a2_pk1 = 1.0 - alpha_pk1 / A_pk1;

    // Normalize
    b0_pk1 /= a0_pk1; b1_pk1 /= a0_pk1; b2_pk1 /= a0_pk1;
    a1_pk1 /= a0_pk1; a2_pk1 /= a0_pk1;

    int32_t n0_2, n1_2, n2_2, d1_2, d2_2;
    scaleAndClamp(b0_pk1, b1_pk1, b2_pk1, a1_pk1, a2_pk1, n0_2, n1_2, n2_2, d1_2, d2_2, "Peak4.5k");

    Serial.printf("    N0=0x%06X, N1=0x%06X, N2=0x%06X, D1=0x%06X, D2=0x%06X\n",
                  n0_2 & 0xFFFFFF, n1_2 & 0xFFFFFF, n2_2 & 0xFFFFFF,
                  d1_2 & 0xFFFFFF, d2_2 & 0xFFFFFF);

    // FILTER 3: Peaking @ 8000Hz, -3dB, BW=1000Hz → Q=8.0
    Serial.println("  Filter 3: Peaking @ 8000Hz, -3dB, Q=8.0");

