schplay/ESP32-AIC3212/src/ESP32_AIC3212.cpp
    float fc_pk2 = 8000.0;
    float gain_pk2 = -3.0;  // dB (cut)
    float Q_pk2 = fc_pk2 / 1000.0;  // Q = fc / BW = 8000 / 1000 = 8.0

    float A_pk2 = pow(10.0, gain_pk2 / 40.0);
    float w0_pk2 = 2.0 * M_PI * fc_pk2 / fs;
    float alpha_pk2 = sin(w0_pk2) / (2.0 * Q_pk2);

    float b0_pk2 = 1.0 + alpha_pk2 * A_pk2;
    float b1_pk2 = -2.0 * cos(w0_pk2);
    float b2_pk2 = 1.0 - alpha_pk2 * A_pk2;
    float a0_pk2 = 1.0 + alpha_pk2 / A_pk2;
    float a1_pk2 = -2.0 * cos(w0_pk2);
    float a2_pk2 = 1.0 - alpha_pk2 / A_pk2;

    // Normalize
    b0_pk2 /= a0_pk2; b1_pk2 /= a0_pk2; b2_pk2 /= a0_pk2;
    a1_pk2 /= a0_pk2; a2_pk2 /= a0_pk2;

    int32_t n0_3, n1_3, n2_3, d1_3, d2_3;
    scaleAndClamp(b0_pk2, b1_pk2, b2_pk2, a1_pk2, a2_pk2, n0_3, n1_3, n2_3, d1_3, d2_3, "Peak8k");

    Serial.printf("    N0=0x%06X, N1=0x%06X, N2=0x%06X, D1=0x%06X, D2=0x%06X\n",
                  n0_3 & 0xFFFFFF, n1_3 & 0xFFFFFF, n2_3 & 0xFFFFFF,
                  d1_3 & 0xFFFFFF, d2_3 & 0xFFFFFF);

    // Switch to Book 80 for biquad coefficient access
    aic_goToBook(80);
    aic_goToPage(0);

    Serial.println("  Writing calculated biquad EQ filters to Buffer A (pages 1-2):");

    // Helper lambda to write a biquad's 5 coefficients
    auto writeBiquad = [this](int biquadNum, int32_t n0, int32_t n1, int32_t n2, int32_t d1, int32_t d2,
                              int leftPage, int rightPage) {
        int leftBase = 12 + (biquadNum * 20);
        int rightBase = 20 + (biquadNum * 20);

        // Mask to 24 bits
        uint32_t n0_24 = n0 & 0xFFFFFF;
        uint32_t n1_24 = n1 & 0xFFFFFF;
        uint32_t n2_24 = n2 & 0xFFFFFF;
        uint32_t d1_24 = d1 & 0xFFFFFF;
        uint32_t d2_24 = d2 & 0xFFFFFF;

        // Left channel
        aic_goToPage(leftPage);
        aic_writePage(leftPage, leftBase,      (n0_24 >> 16) & 0xFF);
        aic_writePage(leftPage, leftBase + 1,  (n0_24 >> 8) & 0xFF);
        aic_writePage(leftPage, leftBase + 2,  n0_24 & 0xFF);
        aic_writePage(leftPage, leftBase + 4,  (n1_24 >> 16) & 0xFF);
        aic_writePage(leftPage, leftBase + 5,  (n1_24 >> 8) & 0xFF);
        aic_writePage(leftPage, leftBase + 6,  n1_24 & 0xFF);
        aic_writePage(leftPage, leftBase + 8,  (n2_24 >> 16) & 0xFF);
        aic_writePage(leftPage, leftBase + 9,  (n2_24 >> 8) & 0xFF);
        aic_writePage(leftPage, leftBase + 10, n2_24 & 0xFF);
        aic_writePage(leftPage, leftBase + 12, (d1_24 >> 16) & 0xFF);
        aic_writePage(leftPage, leftBase + 13, (d1_24 >> 8) & 0xFF);
        aic_writePage(leftPage, leftBase + 14, d1_24 & 0xFF);
        aic_writePage(leftPage, leftBase + 16, (d2_24 >> 16) & 0xFF);
        aic_writePage(leftPage, leftBase + 17, (d2_24 >> 8) & 0xFF);
        aic_writePage(leftPage, leftBase + 18, d2_24 & 0xFF);

        // Right channel
        aic_goToPage(rightPage);
        aic_writePage(rightPage, rightBase,      (n0_24 >> 16) & 0xFF);
        aic_writePage(rightPage, rightBase + 1,  (n0_24 >> 8) & 0xFF);
        aic_writePage(rightPage, rightBase + 2,  n0_24 & 0xFF);
        aic_writePage(rightPage, rightBase + 4,  (n1_24 >> 16) & 0xFF);
        aic_writePage(rightPage, rightBase + 5,  (n1_24 >> 8) & 0xFF);
        aic_writePage(rightPage, rightBase + 6,  n1_24 & 0xFF);
        aic_writePage(rightPage, rightBase + 8,  (n2_24 >> 16) & 0xFF);
        aic_writePage(rightPage, rightBase + 9,  (n2_24 >> 8) & 0xFF);
        aic_writePage(rightPage, rightBase + 10, n2_24 & 0xFF);
        aic_writePage(rightPage, rightBase + 12, (d1_24 >> 16) & 0xFF);
        aic_writePage(rightPage, rightBase + 13, (d1_24 >> 8) & 0xFF);
        aic_writePage(rightPage, rightBase + 14, d1_24 & 0xFF);
        aic_writePage(rightPage, rightBase + 16, (d2_24 >> 16) & 0xFF);
        aic_writePage(rightPage, rightBase + 17, (d2_24 >> 8) & 0xFF);
        aic_writePage(rightPage, rightBase + 18, d2_24 & 0xFF);
    };

    // PRB_P1 has 3 biquads (A, B, C) in signal path.
    // Biquad A: HPF @ 700 Hz — removes DC and sub-bass from the digital signal.
    //   The HP output is DC-coupled (charge pump, no output capacitor); any DC in the
    //   audio stream flows continuously through the headphone load and trips SC protection
    //   after ~1 second.  The HPF eliminates this at the source.
    // Biquads B and C: unity (flat) — no gain boost that could push DSP above 0dBFS.
    const int32_t unity = 0x7FFFFF;  // 24-bit maximum ≈ 1.0 in fixed-point
    const int32_t zero  = 0x000000;

    Serial.println("    Biquad A: HPF @ 700 Hz (DC blocking); Biquad B/C: flat");
    writeBiquad(0, n0_1, n1_1, n2_1, d1_1, d2_1, 1, 2);  // Buffer A: pages 1 & 2
    writeBiquad(1, unity, zero, zero, zero, zero, 1, 2);
    writeBiquad(2, unity, zero, zero, zero, zero, 1, 2);

    // WRITE TO BOTH BUFFERS to ensure coefficients are loaded regardless of which is active
    Serial.println("  Writing same coefficients to Buffer B (pages 9-10)...");
    writeBiquad(0, n0_1, n1_1, n2_1, d1_1, d2_1, 9, 10);  // Buffer B: pages 9 & 10
    writeBiquad(1, unity, zero, zero, zero, zero, 9, 10);
    writeBiquad(2, unity, zero, zero, zero, zero, 9, 10);

    // VERIFY coefficients were written - read back first coefficient of Biquad A
    aic_goToBook(80);
    aic_goToPage(1);
    uint8_t n0_msb = aic_readPage(1, 12);
    uint8_t n0_mid = aic_readPage(1, 13);
    uint8_t n0_lsb = aic_readPage(1, 14);
    uint32_t n0_readback = (n0_msb << 16) | (n0_mid << 8) | n0_lsb;
    Serial.printf("  VERIFY: Biquad A N0 written=0x%06X, read=0x%06X %s\n",
                  (uint32_t)(n0_1 & 0xFFFFFF), n0_readback,
                  (n0_readback == (n0_1 & 0xFFFFFF)) ? "[OK]" : "[MISMATCH!]");

    // Enable adaptive mode (DAC is off, so coefficients can be written)
    aic_goToBook(80);
    aic_goToPage(0);
    aic_writePage(0, 0x01, 0x04);  // D2=1: Enable adaptive mode

    uint8_t status = aic_readPage(0, 0x01);
    Serial.printf("  Adaptive mode enabled: %s\n", (status & 0x04) ? "YES" : "NO");

    // Return to Book 0
    aic_goToBook(0);
    aic_goToPage(0);

    // CRITICAL: Verify PRB_P1 is selected in DAC path
    uint8_t prb_check = aic_readPage(0, 0x3C);
    Serial.printf("  Verification: PRB register (P0_R60) = 0x%02X ", prb_check);
    Serial.println((prb_check & 0x1F) == 0x01 ? "[PRB_P1 active]" : "[WARNING: PRB_P1 NOT active!]");

    Serial.println("  Biquad EQ coefficients ready - will be active when DAC powers up");
}

int ESP32AIC3212::enableHeadphonePower(int chan, bool enable) {
    int ret_val = -1;

    aic_goToBook(0);
    uint8_t cur_val = aic_readPage(1,27);

    if ((chan == AIC3212_BOTH_CHAN) || (chan == AIC3212_LEFT_CHAN)) {
        if (enable) cur_val = cur_val | 0b00000010;
        else cur_val = cur_val & 0b11111101;
        ret_val = chan;
    }
    if ((chan == AIC3212_BOTH_CHAN) || (chan == AIC3212_RIGHT_CHAN)) {
        if (enable) cur_val = cur_val | 0b00000001;
        else cur_val = cur_val & 0b11111110;
        ret_val = chan;
    }

    Serial.print("ESP32AIC3212: enableHeadphonePower: sending ");
    Serial.println(cur_val,BIN);
    aic_writePage(1,27,cur_val);
    cur_val = aic_readPage(1,27);
    Serial.print("ESP32AIC3212: enableHeadphonePower: confirming, received ");
    Serial.println(cur_val,BIN);
    return ret_val;
}

void ESP32AIC3212::enableHeadsetDetection(void) {
    aic_goToBook(0);
    // B0_P0_R67: D7=1 (enable), D[4:2]=010 (64ms insertion debounce), D[1:0]=01 (8ms button
    // debounce).  Used for continuous monitoring in speaker mode.  Detection is kept OFF in
    // HP mode: a TRS plug's sleeve bridges the mic network (MICBIAS_EXT/MICDET) into the
    // Ring2/HPVSS_SENSE ground-sense node, so detection bias must not be live while the HP
    // drivers carry audio.  HP-mode checks use checkHeadsetPresence() instead.
    aic_writePage(0, 0x43, 0x89);
}

void ESP32AIC3212::disableHeadsetDetection(void) {
    aic_goToBook(0);
    aic_writePage(0, 0x43, 0x00);  // P0_R67: D7=0 disables detection (MICBIAS_EXT is permanently off via P1_R51=0x80)
}

bool ESP32AIC3212::isHeadsetInserted(void) {
    aic_goToBook(0);
    // Insertion = R46 D4 status flag OR R37 D[1:0] headphone-load classification.
    // With MICBIAS_EXT permanently disabled (P1_R51=0x80 — headset mic unused), it is
    // undocumented whether the R46 D4 flag still fires without the MICDET measurement,
    // so accept either indicator.  R37 D[1:0] != 00 = mono/stereo headset load detected
    // by the bias-independent HP-pin probe (valid in ground-centered mode, SLAU360 5.2.33).
    uint8_t r46 = (uint8_t)aic_readPage(0, 0x2E);
    uint8_t r37 = (uint8_t)aic_readPage(0, 0x25);
    return ((r46 & 0x10) != 0) || ((r37 & 0x03) != 0);
}

bool ESP32AIC3212::checkHeadsetPresence(bool currently_using_hp) {
    // JIT insertion check — called once at the start of every playback request, BEFORE any
    // audio flows.  SLAU360 2.12.2: P0_R46 D4 is the instantaneous insertion state behind
    // the detection debounce; it is only meaningful while detection is enabled and after at
    // least one debounce period has elapsed.  (A read taken immediately after enabling
    // detection returns the reset value, NOT the real state — that bug caused the output
    // to flip to speaker with headphones still inserted.)
    if (!currently_using_hp) {
        // Speaker mode: detection has been running continuously since outputSelect(Spk)
        // re-enabled it, so the status read is immediately valid.  Zero added latency.
        aic_goToBook(0);
        uint8_t r46 = (uint8_t)aic_readPage(0, 0x2E);
        uint8_t r37 = (uint8_t)aic_readPage(0, 0x25);
        bool inserted = ((r46 & 0x10) != 0) || ((r37 & 0x03) != 0);
        Serial.printf("[HS-CHECK] SPK mode: R46=0x%02X R37=0x%02X -> %s\n",
                      r46, r37, inserted ? "INSERTED" : "not inserted");
        Serial.flush();  // critical diagnostic — don't let TX buffer overflow mangle it
        return inserted;
    }
    // HP mode: detect -> reset -> (caller switches if changed) -> play.
    //
    // The detection engine's load probe is the only way to sense removal, but probing
    // with powered drivers under the internal-ground common mode wedges the HP analog
    // stage (proven: with the probe, every following playback was silent; without it,
    // everything played).  A reboot's aic_init heals the wedge, so after a probe that
    // confirms the headset is still inserted, re-assert the analog common-mode /
    // charge-pump configuration the probe disturbs, BEFORE any audio flows.
    // If the headset was removed, no heal is needed — the caller runs a full
    // outputSelect(speaker) which powers the HP drivers down anyway.
    aic_goToBook(0);
    aic_writePage(0, 0x43, 0x81);   // D7=1 enable, D[4:2]=000 (16ms debounce), D[1:0]=01
    delay(25);                      // > one 16ms debounce period
    uint8_t r46 = (uint8_t)aic_readPage(0, 0x2E);
    uint8_t r37 = (uint8_t)aic_readPage(0, 0x25);
    aic_writePage(0, 0x43, 0x00);   // detection back off for HP mode
    bool inserted = ((r46 & 0x10) != 0) || ((r37 & 0x03) != 0);
    Serial.printf("[HS-CHECK] HP mode: R46=0x%02X R37=0x%02X -> %s\n",
                  r46, r37, inserted ? "INSERTED" : "removed");
    Serial.flush();  // critical diagnostic — don't let TX buffer overflow mangle it
    if (inserted) {
        // HEAL: re-assert the analog config (same values, same order as aic_init).
        aic_writePage(1, 0x08, 0x03);  // common mode
        aic_writePage(1, 0x23, 0x31);  // charge pump forced on + dynamic offset cal
        aic_writePage(1, 0x22, 0xBE);  // internal-ground CM + offset correction
        delay(5);                      // let the analog stage settle before audio
    }
    return inserted;
}

