schplay/ESP32-AIC3212/src/ESP32_AIC3212.cpp
void ESP32AIC3212::diagHP(void) {
    aic_goToBook(0);
    // Snapshot of all registers that control the HP output path
    uint8_t p1r09 = (uint8_t)aic_readPage(1, 0x09);  // HP driver sizing / OC config
    uint8_t p1r1B = (uint8_t)aic_readPage(1, 0x1B);  // HP driver power + routing (P1_R27)
    uint8_t p1r1F = (uint8_t)aic_readPage(1, 0x1F);  // HPL volume / GC mode / mute (P1_R31)
    uint8_t p1r20 = (uint8_t)aic_readPage(1, 0x20);  // HPR volume (P1_R32)
    uint8_t p1r23 = (uint8_t)aic_readPage(1, 0x23);  // Charge pump config (P1_R35)
    uint8_t p0r3F = (uint8_t)aic_readPage(0, 0x3F);  // DAC channel power (P0_R63)
    uint8_t p0r40 = (uint8_t)aic_readPage(0, 0x40);  // DAC mute / auto-mute (P0_R64)
    // Sticky interrupt flags — cleared on read; capture HP SC/OC events
    uint8_t p0r2C = (uint8_t)aic_readPage(0, 0x2C);  // P0_R44: sticky interrupt flags 1
    uint8_t p0r2D = (uint8_t)aic_readPage(0, 0x2D);  // P0_R45: sticky interrupt flags 2
    uint8_t p0r2E = (uint8_t)aic_readPage(0, 0x2E);  // P0_R46: real-time flags 1 (headset/HP status)
    uint8_t p0r2F = (uint8_t)aic_readPage(0, 0x2F);  // P0_R47: real-time flags 2
    Serial.printf("[HP-DIAG] P1:R09=%02X R1B=%02X R1F=%02X R20=%02X R23=%02X | P0:R3F=%02X R40=%02X | FLAGS:R2C=%02X R2D=%02X R2E=%02X R2F=%02X\n",
                  p1r09, p1r1B, p1r1F, p1r20, p1r23, p0r3F, p0r40, p0r2C, p0r2D, p0r2E, p0r2F);
}

uint8_t ESP32AIC3212::readP1R1B(void) {
    aic_goToBook(0);
    return (uint8_t)aic_readPage(1, 0x1B);
}

uint8_t ESP32AIC3212::readP0R43(void) {
    aic_goToBook(0);
    return (uint8_t)aic_readPage(0, 0x43);
}

uint8_t ESP32AIC3212::readSCFlags(void) {
    // Reads and clears the sticky HP SC flags in P0_R44.
    // D7=HPL SC, D6=HPR SC.  Returns 0x00 if no SC event has occurred since last read.
    aic_goToBook(0);
    return (uint8_t)aic_readPage(0, 0x2C);
}

void ESP32AIC3212::setDACMute(bool mute) {
    // Bracket HP driver transitions and i2s_set_clk() calls with mute/unmute to suppress pops.
    aic_goToBook(0);
    aic_writePage(0, 0x40, mute ? 0x0C : 0x00);
}

bool ESP32AIC3212::outputSelect(AIC_Output left, AIC_Output right, bool flag_full)
{
    if (debugToSerial) Serial.println("# ESP32AIC3212: outputSelect");

    if (firstTime_outputSelect) {
        flag_full = true;
        firstTime_outputSelect = false;
    }

    aic_goToBook(0);

    // === MUTE DAC FIRST TO PREVENT POPS ===
    aic_writePage(0, 0x40, 0x0C);  // Mute both DAC channels

    if (flag_full) {
        aic_writePage(1, 0x1F, 0xB9);  // HPL mute
        aic_writePage(1, 0x20, 0xB9);  // HPR mute
        aic_writePage(1, 0x16, 0x00);  // Disable LOL/LOR routing
        aic_writePage(1, 0x1B, 0x00);  // Disable HPL/HPR routing
        aic_writePage(1, 0x10, 0x00);  // Mute LOL output
        aic_writePage(1, 0x12, 0x00);  // Mute LOR output
    }

    // === CLEAR ALL OUTPUTS (AIC3212 registers only) ===
    aic_writePage(1, 0x2C, 0x00);  // HP driver power off
    aic_writePage(1, 0x1F, 0xB9);  // Mute HPL
    aic_writePage(1, 0x20, 0xB9);  // Mute HPR
    aic_writePage(1, 0x10, 0x00);  // Mute LOL
    aic_writePage(1, 0x12, 0x00);  // Mute LOR
    aic_writePage(1, 0x2D, 0x00);  // Power down SPKL and SPKR drivers
    aic_writePage(1, 0x2F, 0x3F);  // Mute SPKR amp (LOR→SPKR path, reset default)

    uint8_t p1_r16 = 0x00, p1_r1B = 0x00, p1_r1F = 0xB9, p1_r20 = 0xB9;
    uint8_t p1_r10 = 0x00, p1_r12 = 0x00;  // Line output volumes

    bool use_output = false;

    // === RIGHT SPEAKER ONLY ===
    if (right == Aic_Output_Spk) {
        p1_r16 = 0x43;       // DAC_R → LOR, power up LOL/LOR drivers
        aic_writePage(1, 0x2D, 0x03);  // Power SPKL (D1) and SPKR (D0)
        aic_writePage(1, 0x2F, 0x00);  // Route LOR to SPKR @ 0dB (per TI reference design)
        use_output = true;
    }

    // === HEADPHONES (DUAL-MONO) ===
    if (left == Aic_Output_Hp || right == Aic_Output_Hp) {
        p1_r1B |= 0x20;      // DAC_L → HPL
        p1_r1F = 0x80;       // Unmute HPL
        p1_r1B |= 0x10;      // DAC_R → HPR
        p1_r20 = 0x80;       // Unmute HPR
        // Note: P1_R44 (0x2C) is a reserved register — no write needed here
        use_output = true;
    }

    bool using_headphones = (left == Aic_Output_Hp || right == Aic_Output_Hp);

    // === POWER UP DACs AND CONFIGURE ANALOG PATH ===
    if (use_output) {
        // STEP 1: Set DAC PowerTune Mode BEFORE powering up DAC
        aic_writePage(1, 0x03, static_cast<uint8_t>(pConfig->dac.ptm_p) << 2);  // Left DAC PTM
        aic_writePage(1, 0x04, static_cast<uint8_t>(pConfig->dac.ptm_p) << 2);  // Right DAC PTM

        // STEP 2: Route DAC outputs and configure analog path
        aic_writePage(1, 0x16, p1_r16);  // Line out routing/power
        aic_writePage(1, 0x1B, p1_r1B);  // Headphone routing (initial)

        // STEP 3: Power up LDAC and RDAC
        uint8_t dac_power = ((left == Aic_Output_None) ? 0x00 : 0x80)
                          | ((right == Aic_Output_None) ? 0x00 : 0x40);
        aic_writePage(0, 0x3F, dac_power);

        // STEP 4: Set volume/mute registers
        aic_writePage(1, 0x1F, p1_r1F);  // HPL gain/mute
        aic_writePage(1, 0x20, p1_r20);  // HPR gain/mute
        aic_writePage(1, 0x10, p1_r10);  // LOL volume
        aic_writePage(1, 0x12, p1_r12);  // LOR volume

        // STEP 5: Headphone-specific power-up sequence (if using headphones)
        if (using_headphones) {
            // Disable headset detection before powering HP drivers.
            // A TRS plug's sleeve bridges the mic network (MICBIAS_EXT/MICDET) into the
            // Ring2/HPVSS_SENSE ground-sense node, so detection bias must not be live
            // while the HP drivers are active.
            disableHeadsetDetection();
            // Calculate headphone driver power bits
            uint8_t hp_power = 0x00;
            if (left  == Aic_Output_Hp) hp_power |= 0x22;  // HPL routing (D5) + driver (D1)
            if (right == Aic_Output_Hp) hp_power |= 0x11;  // HPR routing (D4) + driver (D0)
            // P1_R09: D[6:5]=00 (100% output stage), D4=1 (reserved, reset value), D[3:1]=100
            // (64µs SC glitch rejection), D0=0 — on over-current the driver LIMITS current and
            // keeps running instead of latching itself off.  Matches TI's ground-centered
            // example scripts (SLAU360 4.1.x) and eliminates the permanently-silenced-output
            // failure mode that required register save/restore recovery machinery.
            aic_writePage(1, 0x09, 0x18);
            // Routing (STEP 2), gain and unmute (STEP 4) are already configured — per
            // SLAU360 2.3.3.4 everything must be set BEFORE driver power-up.  Power up last:
            aic_writePage(1, 0x1B, hp_power);
            // Offset calibration runs automatically right after EVERY HP power-up and no
            // signal may be applied until it completes (SLAU360 2.3.3.4) — audio injected
            // into the cal window produces clicks/truncated audio/pops.  TI does not publish
            // the cal duration; 300ms is a conservative wait, paid only on insertion switches.
            // (A previous first-power-up-only optimization caused intermittent TRRS sine
            // failures when audio started ~10ms after a re-power.)
            delay(300);
        }

        // STEP 6: Unmute LDAC and RDAC
        aic_writePage(0, 0x40, ((left == Aic_Output_None) ? 0x08 : 0x00)
                             | ((right == Aic_Output_None) ? 0x04 : 0x00));

        // Verification
        Serial.println("\n=== Output Configuration Complete ===");
        Serial.print("DAC Power (P0 R0x3F): 0x");
        Serial.println(dac_power, HEX);
        if (using_headphones) {
            Serial.print("HP Driver/Routing (P1 R0x1B): 0x");
            Serial.println(aic_readPage(1, 0x1B), HEX);
            Serial.print("HPL Vol/GC/Mute  (P1 R0x1F): 0x");
            Serial.println(aic_readPage(1, 0x1F), HEX);
            Serial.print("HPR Vol          (P1 R0x20): 0x");
            Serial.println(aic_readPage(1, 0x20), HEX);
            Serial.print("DAC Mute         (P0 R0x40): 0x");
            Serial.println(aic_readPage(0, 0x40), HEX);
        } else {
            Serial.print("Line Out Routing (P1 R0x16): 0x");
            Serial.println(aic_readPage(1, 0x16), HEX);
            Serial.print("Speaker Amplifier Control (P1 R0x2D): 0x");
            Serial.println(aic_readPage(1, 0x2D), HEX);
            Serial.print("Speaker Gain/Mute (P1 R0x2F): 0x");
            Serial.println(aic_readPage(1, 0x2F), HEX);
        }
    } else {
        // No output selected - ensure DAC is off
        aic_writePage(0, 0x3F, 0x00);
    }

    // Re-enable headset detection whenever HP output is not active,
    // so insertion can be detected again.
    if (!using_headphones) {
        enableHeadsetDetection();
    }

