schplay/ESP32-AIC3212/src/ESP32_AIC3212.cpp
    return true;
}

// Mute / unmute line out
void ESP32AIC3212::muteLineOut(bool flag)
{
    aic_goToBook(0);
    byte curValL = aic_readPage(1, 18);
    byte curValR = aic_readPage(1, 19);

    aic_goToPage(1);
    if (flag == true)
    {
        if (curValL & 0b01000000) aic_writeRegister(18, curValL & 0b10111111);
        if (curValR & 0b01000000) aic_writeRegister(19, curValR & 0b10111111);
    }
    else
    {
        if (!(curValL & 0b01000000)) aic_writeRegister(18, curValL | 0b0100000000);
        if (!(curValR & 0b01000000)) aic_writeRegister(19, curValR | 0b0100000000);
    }
}

void ESP32AIC3212::aic_init()
{
    if (debugToSerial) Serial.println("# ESP32AIC3212: Initializing AIC");
    if (debugToSerial) {
        Serial.print("# DEBUG: pConfig->i2s_bits = ");
        Serial.println(static_cast<uint8_t>(pConfig->i2s_bits));
    }
    aic_goToBook(0);
    aic_writePage(1, 0x01, 0x00);
    aic_writePage(1, 0x7a, 0x01);
    aic_writePage(1, 0x79, 0x33);
    aic_writePage(1, 0x08, 0x03);  // Common mode: D[4:3]=00 required for ground-centered HP (SLAU360), D[1:0]=11 (1.65V REC CM)
    aic_writePage(1, 0x23, 0x31);  // P1_R35: D5=1 (DC offset calibration ON — required per SLAU360 for ground-centered HP mode; without it DC offset builds on HPL/HPR over ~1s causing driver overcurrent), D4=1 (reserved, must write 1), D[1:0]=01 (forced CP power-up — VNEG stable before HP drivers activate)
    aic_writePage(1, 0x22, 0xBE);  // P1_R34: D[7:6]=10 (INTERNAL GROUND sets the output common-mode, SLAU360 5.3.27 — NOT the sense pin: on this board Ring2/HPVSS_SENSE has no DC tie to board ground, so with a TRRS plug the node floats, the servo chases it, DC builds across the earpieces until idle OC events fire [seen as sticky R2C=0xC0] and the output rails silent; TRS plugs are immune only because they short the mic network's pin clamps onto the node), D[4:2]=111 (1x CP peak current), D[1:0]=10 (DC offset correction enabled for selected routings per TI GC script SLAU360 4.7.1)
    aic_writePage(1, 0x77, 0x95);  // P1_R119: headset-detect probe tuning, default values except D0=1 — do NOT auto-slow the probe pulse period 16x when a mic is detected (SLAU360 5.3.59); the slowed probing falls into the audio band and is audible as a whine in TRRS headsets while detection runs
    aic_writePage(1, 0x33, 0x80);  // P1_R51: D7=1, D6=0 — MICBIAS_EXT permanently OFF, detached from jack/mic-detect automation (SLAU360 5.3.42). On this hardware the bias return path is THROUGH the headset mic into Ring2 = HPVSS_SENSE; when the engine auto-powered MICBIAS_EXT on mic detection (TRRS only), the DC into the ground-sense node wedged the ground-centered HP servo. Headset mic is unused by design (per David, June 2026).

    // Clock config
    aic_writePage(0, 0x04, static_cast<uint8_t>(pConfig->dac.clk_src) << 4 | static_cast<uint8_t>(pConfig->adc.clk_src));
    if (pConfig->pll.enabled)
    {
        aic_writePage(0, 0x05, static_cast<uint8_t>(pConfig->pll.range) | static_cast<uint8_t>(pConfig->pll.src) << 2);
        aic_writePage(0, 0x06, 0x80 | ((pConfig->pll.p & 0x07) << 4) | (pConfig->pll.r & 0x0F));
        aic_writePage(0, 0x07, pConfig->pll.j & 0x3F);
        aic_writePage(0, 0x08, (pConfig->pll.d >> 8) & 0x3F);
        aic_writePage(0, 0x09, pConfig->pll.d & 0xFF);
        aic_writePage(0, 0x0A, pConfig->pll.clkin_div & 0x7F);
    }
    else
    {
        aic_writePage(0, 0x06, 0x00);
    }

    // DAC Clock
    aic_writePage(0, 0x0B, (pConfig->dac.ndac != 0 ? 0x80 : 0x00) | (pConfig->dac.ndac & 0x7F));
    aic_writePage(0, 0x0C, (pConfig->dac.mdac != 0 ? 0x80 : 0x00) | (pConfig->dac.mdac & 0x7F));
    aic_writePage(0, 0x0D, (pConfig->dac.dosr >> 8) & 0x03);
    aic_writePage(0, 0x0E, pConfig->dac.dosr & 0xFF);

    // ADC Clock
    aic_writePage(0, 0x12, (pConfig->adc.nadc != 0 ? 0x80 : 0x00) | (pConfig->adc.nadc & 0x7F));
    aic_writePage(0, 0x13, (pConfig->adc.madc != 0 ? 0x80 : 0x00) | (pConfig->adc.madc & 0x7F));
    aic_writePage(0, 0x14, pConfig->adc.aosr & 0xFF);

    // ASI1 routing and I2S configuration
    // aic_writePage(4, 0x01, (static_cast<uint8_t>(pConfig->i2s_bits) << 3));
    uint8_t word_len = static_cast<uint8_t>(pConfig->i2s_bits) << 3;
    if (debugToSerial) {
        Serial.print("# DEBUG: Writing P4.R1 = 0x");
        Serial.println(word_len, HEX);
    }
    aic_writePage(4, 0x01, word_len);
    if (pConfig->i2s_clk_dir == I2S_Clock_Dir::AIC_INPUT)
    {
        aic_writePage(4, 0x0A, 0x00);
    }
    else
    {
        aic_writePage(4, 0x0A, 0x24);
    }
    aic_writePage(4, 0x41, 0x04);
    aic_writePage(4, 0x43, 0x02);
    aic_writePage(4, 0x44, 0x20);  // Enable DIN1 Pin (bit 5 = 1)
    aic_writePage(4, 0x07, 0x02);  // Route ASI1_R to DAC_R for right-only mono speaker output
    aic_writePage(4, 0x08, 0x50);  // ASI1 to DAC datapath (from original Tympan code)
    aic_writePage(4, 0x76, 0x06);

    // CRITICAL: Enable processing block FIRST (required before DAC/ADC power-up)
    aic_writePage(0, 0x3C, pConfig->dac.prb_p & 0x1F);  // Enable PRB_P
    aic_writePage(0, 0x3D, pConfig->adc.prb_r & 0x1F);  // Enable PRB_R (for ADC)

    // === VERIFY CRITICAL REGISTERS IMMEDIATELY ===
    Serial.println("\n=== Verifying critical register writes in aic_init() ===");
    uint8_t verify_val;
    verify_val = (uint8_t)aic_readPage(4, 0x44);
    Serial.print("P4 R0x44 (DIN1 enable): Wrote=0x20, Read=0x");
    Serial.print(verify_val, HEX);
    Serial.println((verify_val & 0x20) ? " [OK - DIN1 enabled]" : " [FAIL]");

    verify_val = (uint8_t)aic_readPage(4, 0x07);
    Serial.print("P4 R0x07 (ASI1_DOUT): Wrote=0x02, Read=0x");
    Serial.print(verify_val, HEX);
    Serial.println(verify_val == 0x02 ? " [OK]" : " [FAIL]");

    verify_val = (uint8_t)aic_readPage(4, 0x08);
    Serial.print("P4 R0x08 (ASI1 to DAC): Wrote=0x50, Read=0x");
    Serial.print(verify_val, HEX);
    Serial.println(verify_val == 0x50 ? " [OK]" : " [FAIL]");

    verify_val = (uint8_t)aic_readPage(0, 0x3C);
    Serial.print("P0 R0x3C (DAC PRB): Wrote=0x");
    Serial.print(pConfig->dac.prb_p & 0x1F, HEX);
    Serial.print(", Read=0x");
    Serial.print(verify_val, HEX);
    Serial.println((verify_val & 0x1F) == (pConfig->dac.prb_p & 0x1F) ? " [OK]" : " [FAIL]");
    Serial.println("=== End verification ===\n");

    // PowerTune Modes (PTM) - set AFTER PRB configuration (per Tympan reference)
    aic_writePage(1, 0x03, static_cast<uint8_t>(pConfig->dac.ptm_p) << 2);  // Left DAC PTM
    aic_writePage(1, 0x04, static_cast<uint8_t>(pConfig->dac.ptm_p) << 2);  // Right DAC PTM
    aic_writePage(1, 0x3D, static_cast<uint8_t>(pConfig->adc.ptm_r) << 6);  // ADC PTM

    // Write biquad coefficients while DAC is powered down (required — locked when DAC runs)
    writeBiquadCoefficients();
}

// I2C read/write helpers using wrapper
unsigned int ESP32AIC3212::aic_readPage(uint8_t page, uint8_t reg)
{
    unsigned int val;

    if (aic_goToPage(page))
    {
        if (!myWire) {
            if (debugToSerial) Serial.println("ESP32AIC3212: ERROR: No I2C interface set");
            return 700;
        }

