schplay/ESP32-AIC3212/src/ESP32_AIC3212.cpp
        myWire->beginTransmission(static_cast<uint8_t>(i2cAddress));
        myWire->write(reg);
        unsigned int result = myWire->endTransmission();
        if (result != 0)
        {
            Serial.print("ESP32AIC3212: ERROR: Read Page.  Page: ");
            Serial.print(page);
            Serial.print(" Reg: ");
            Serial.print(reg);
            Serial.print(".  Received Error During Read Page: ");
            Serial.println(result);
            val = 300 + result;
            return val;
        }
        if (myWire->requestFrom(static_cast<uint8_t>(i2cAddress), 1U) < 1)
        {
            Serial.print("ESP32AIC3212: ERROR: Read Page.  Page: ");
            Serial.print(page);
            Serial.print(" Reg: ");
            Serial.print(reg);
            Serial.println(".  Nothing to return");
            val = 400;
            return val;
        }
        if (myWire->available() >= 1)
        {
            uint16_t v = (uint16_t)myWire->read();
            if (debugToSerial)
            {
                Serial.print("# ESP32AIC3212: Read Page.   Page: ");
                Serial.print(page);
                Serial.print(" Reg: ");
                Serial.print(reg);
                Serial.print(".  Received: 0x");
                Serial.println(v, HEX);
            }
            return v;
        }
    }
    else
    {
        Serial.print("ESP32AIC3212: INFO: Read Page.   Page: ");
        Serial.print(page);
        Serial.print(" Reg: ");
        Serial.print(reg);
        Serial.println(".  Failed to go to read page.  Could not go there.");
        val = 500;
        return val;
    }
    val = 600;
    return val;
}

bool ESP32AIC3212::aic_writePage(uint8_t page, uint8_t reg, uint8_t val)
{
    bool success = true;

    if (debugToSerial)
    {
        Serial.print("# ESP32AIC3212: Write Page.  Page: ");
        Serial.print(page);
        Serial.print(" Reg: ");
        Serial.print(reg);
        Serial.print(" Val: 0x");
        Serial.println(val, HEX);
    }

    success = aic_goToPage(page);
    if (success)
    {
        success = aic_writeRegister(reg, val);
    }
    else
    {
        Serial.print("ESP32AIC3212: Received Error During aic_goToPage()");
    }

    return success;
}

unsigned int ESP32AIC3212::aic_readRegister(uint8_t reg, uint8_t *pVal)
{
    unsigned int errcode = 0;

    if (!myWire) {
        Serial.println("ESP32AIC3212: ERROR: No I2C interface set");
        return 700;
    }

    myWire->beginTransmission(static_cast<uint8_t>(i2cAddress));
    myWire->write(reg);
    unsigned int result = myWire->endTransmission();
    if (result != 0)
    {
        Serial.print("ESP32AIC3212: ERROR: Read register.  Reg: ");
        Serial.print(reg);
        Serial.print(".  Received Error During Write Address: ");
        Serial.println(result);
        errcode = 300 + result;
    }

    if (errcode == 0)
    {
        if (myWire->requestFrom(static_cast<uint8_t>(i2cAddress), 1U) < 1)
        {
            Serial.print("ESP32AIC3212: ERROR: Read register.  Reg: ");
            Serial.print(reg);
            Serial.println(".  Received Error During Request.");
            errcode = 400;
        }
    }

    if (errcode == 0)
    {
        if (myWire->available() >= 1)
        {
            *pVal = (uint8_t)myWire->read();
        }
        else
        {
            Serial.print("ESP32AIC3212: ERROR: Read register.  Reg: ");
            Serial.print(reg);
            Serial.println(".  Empty Response.");
            errcode = 500;
        }
    }

    return errcode;
}

bool ESP32AIC3212::aic_writeRegister(uint8_t reg, uint8_t val)
{ // assumes page has already been set
    if (debugToSerial)
    {
        Serial.print("w ");
        Serial.print(i2cAddress, HEX);
        Serial.print(" ");
        Serial.print(reg, HEX);
        Serial.print(" ");
        Serial.println(val, HEX);
    }

    if (!myWire) {
        Serial.println("ESP32AIC3212: ERROR: No I2C interface set");
        return false;
    }

    myWire->beginTransmission(static_cast<uint8_t>(i2cAddress));
    myWire->write(reg);
    myWire->write(val);
    uint8_t result = myWire->endTransmission();
    if (result == 0)
    {
        return true;
    }
    else
    {
        Serial.print("ESP32AIC3212: Received Error During writeRegister(): Error = ");
        Serial.println(result);
    }
    return false;
}

bool ESP32AIC3212::aic_goToPage(uint8_t page)
{
    return aic_writeRegister(0x00, page);
}

bool ESP32AIC3212::aic_goToBook(uint8_t book)
{
    bool success = true;

    if (debugToSerial)
    {
        Serial.print("# ESP32AIC3212: Go To Book ");
        Serial.print(book);
        Serial.println(".");
    }
    // Go to page 0 of current book
    success = aic_goToPage(0x00);
    if (success)
    {
        // Select book by writing to register 0x7F (Book Select Register)
        success = aic_writeRegister(0x7F, book);
    }
    else
    {
        // Already failed
    }
    return success;
}

// ---------- Biquad & IIR coefficient helper functions (restored) ----------
void ESP32AIC3212::computeBiquadCoeff_LP_f32(float freq_Hz, float sampleRate_Hz, float q, float *coeff)
{
    double w0 = freq_Hz * (2.0 * 3.141592654 / sampleRate_Hz);
    double sinW0 = sin(w0);
    double alpha = sinW0 / ((double)q * 2.0);
    double cosW0 = cos(w0);
    double scale = 1.0 / (1.0 + alpha);
    /* b0 */ coeff[0] = ((1.0 - cosW0) / 2.0) * scale;
    /* b1 */ coeff[1] = (1.0 - cosW0) * scale;
    /* b2 */ coeff[2] = coeff[0];
    /* a0 = 1.0 in Matlab style */
    /* a1 */ coeff[3] = (-2.0 * cosW0) * scale;
    /* a2 */ coeff[4] = (1.0 - alpha) * scale;

    coeff[1] = coeff[1] / 2.0;
    coeff[3] = -coeff[3] / 2.0;
    coeff[4] = -coeff[4];
}

void ESP32AIC3212::computeBiquadCoeff_HP_f32(float freq_Hz, float sampleRate_Hz, float q, float *coeff)
{
    double w0 = freq_Hz * (2 * 3.141592654 / sampleRate_Hz);
    double sinW0 = sin(w0);
    double alpha = sinW0 / ((double)q * 2.0);
    double cosW0 = cos(w0);
    double scale = 1.0 / (1.0 + alpha);
    coeff[0] = ((1.0 + cosW0) / 2.0) * scale;
    coeff[1] = -(1.0 + cosW0) * scale;
    coeff[2] = coeff[0];
    coeff[3] = (-2.0 * cosW0) * scale;
    coeff[4] = (1.0 - alpha) * scale;

