schplay/ESP32-AIC3212/src/ESP32_AIC3212.cpp
    coeff[1] = coeff[1] / 2.0;
    coeff[3] = -coeff[3] / 2.0;
    coeff[4] = -coeff[4];
}

#define CONST_2_31_m1 (2147483647)

void ESP32AIC3212::convertCoeff_f32_to_i32(float *coeff_f32, int32_t *coeff_i32, int ncoeff)
{
    for (int i = 0; i < ncoeff; i++)
    {
        coeff_f32[i] *= (float)CONST_2_31_m1;
        coeff_i32[i] = (int32_t)coeff_f32[i];
    }
}

int ESP32AIC3212::setBiquadCoeffOnADC(int chanIndex, int biquadIndex, uint32_t *coeff_uint32)
{
    aic_goToBook(0);
    uint32_t prev_state = aic_readPage(0x00, 0x51);
    aic_writePage(0x00, 0x51, prev_state & (0b00111111));

    int page_reg_table[] = {
        8, 36, 9, 44, // N0, start of Biquad A
        8, 40, 9, 48, // N1
        8, 44, 9, 52, // N2
        8, 48, 9, 56, // D1
        8, 52, 8, 64, // D2
        8, 56, 9, 64, // start of biquad B
        8, 60, 9, 68,
        8, 64, 9, 72,
        8, 68, 9, 76,
        8, 72, 9, 80,
        8, 76, 9, 84, // start of Biquad C
        8, 80, 9, 88,
        8, 84, 9, 92,
        8, 88, 9, 96,
        8, 92, 9, 100,
        8, 96, 9, 104, // start of Biquad D
        8, 100, 9, 108,
        8, 104, 9, 112,
        8, 108, 9, 116,
        8, 112, 9, 120,
        8, 116, 9, 124, // start of Biquad E
        8, 120, 10, 8,
        8, 124, 10, 12,
        9, 8, 10, 16,
        9, 12, 10, 20};

    const int rows_per_biquad = 5;
    const int table_ncol = 4;
    int chan_offset;

    switch (chanIndex)
    {
    case Left_Chan:
        chan_offset = 0;
        writeBiquadCoeff(coeff_uint32, page_reg_table + chan_offset + biquadIndex * rows_per_biquad * table_ncol, table_ncol);
        break;
    case Right_Chan:
        chan_offset = 1;
        writeBiquadCoeff(coeff_uint32, page_reg_table + chan_offset + biquadIndex * rows_per_biquad * table_ncol, table_ncol);
        break;
    default:
        return -1;
        break;
    }

    aic_writePage(0x00, 0x51, prev_state);
    return 0;
}

void ESP32AIC3212::writeBiquadCoeff(uint32_t *coeff_uint32, int *page_reg_table, int table_ncol)
{
    int page, reg;
    uint32_t c;
    for (int i = 0; i < 5; i++)
    {
        page = page_reg_table[i * table_ncol];
        reg = page_reg_table[i * table_ncol + 1];
        c = coeff_uint32[i];
        aic_writePage(page, reg, (uint8_t)(c >> 24));
        aic_writePage(page, reg + 1, (uint8_t)(c >> 16));
        aic_writePage(page, reg + 2, (uint8_t)(c >> 8));
    }
    return;
}

void ESP32AIC3212::setHPFonADC(bool enable, float cutoff_Hz, float fs_Hz)
{
    uint32_t coeff[3];
    if (enable)
    {
        HP_cutoff_Hz = cutoff_Hz;
        float coeff_f32[3];
        computeFirstOrderHPCoeff_f32(cutoff_Hz, fs_Hz, coeff_f32);
        convertCoeff_f32_to_i32(coeff_f32, (int32_t *)coeff, 3);
    }
    else
    {
        HP_cutoff_Hz = cutoff_Hz;
        coeff[0] = 0x7FFFFFFF;
        coeff[1] = 0;
        coeff[2] = 0;
    }

    setHpfIIRCoeffOnADC(Left_Chan, coeff);
    setHpfIIRCoeffOnADC(Right_Chan, coeff);
}

void ESP32AIC3212::computeFirstOrderHPCoeff_f32(float cutoff_Hz, float fs_Hz, float *coeff)
{
    const float pi = 3.141592653589793;
    float T = 1.0f / fs_Hz; // sample period
    float w = cutoff_Hz * 2.0 * pi;
    float A = 1.0f / (tan((w * T) / 2.0));
    coeff[0] = A / (1.0 + A);
    coeff[1] = -coeff[0];
    coeff[2] = (1.0 - A) / (1.0 + A);
    coeff[2] = -coeff[2];
}

void ESP32AIC3212::setHpfIIRCoeffOnADC(int chan, uint32_t *coeff)
{
    aic_goToBook(0);
    uint32_t prev_state = aic_readPage(0x00, 0x51);
    aic_writePage(0x00, 0x51, prev_state & (0b00111111));

    if (chan == Left_Chan)
    {
        setHpfIIRCoeffOnADC_Left(coeff);
    }
    else if (chan == Right_Chan)
    {
        setHpfIIRCoeffOnADC_Right(coeff);
    }

    aic_writePage(0x00, 0x51, prev_state);
}

void ESP32AIC3212::setHpfIIRCoeffOnADC_Left(uint32_t *coeff)
{
    uint32_t c;

    aic_goToBook(AIC3212_ADC_IIR_FILTER_BOOK);

    c = coeff[0];
    aic_writePage(AIC3212_ADC_IIR_FILTER_LEFT_PAGE, 24, (uint8_t)(c >> 24));
    aic_writePage(AIC3212_ADC_IIR_FILTER_LEFT_PAGE, 25, (uint8_t)(c >> 16));
    aic_writePage(AIC3212_ADC_IIR_FILTER_LEFT_PAGE, 26, (uint8_t)(c >> 8));

    c = coeff[1];
    aic_writePage(AIC3212_ADC_IIR_FILTER_LEFT_PAGE, 28, (uint8_t)(c >> 24));
    aic_writePage(AIC3212_ADC_IIR_FILTER_LEFT_PAGE, 29, (uint8_t)(c >> 16));
    aic_writePage(AIC3212_ADC_IIR_FILTER_LEFT_PAGE, 30, (uint8_t)(c >> 8));

    c = coeff[2];
    aic_writePage(AIC3212_ADC_IIR_FILTER_LEFT_PAGE, 32, (uint8_t)(c >> 24));
    aic_writePage(AIC3212_ADC_IIR_FILTER_LEFT_PAGE, 33, (uint8_t)(c >> 16));
    aic_writePage(AIC3212_ADC_IIR_FILTER_LEFT_PAGE, 34, (uint8_t)(c >> 8));

    aic_goToBook(0);
}

void ESP32AIC3212::setHpfIIRCoeffOnADC_Right(uint32_t *coeff)
{
    uint32_t c;

    aic_goToBook(AIC3212_ADC_IIR_FILTER_BOOK);

    c = coeff[0];
    aic_writePage(AIC3212_ADC_IIR_FILTER_RIGHT_PAGE, 32, (uint8_t)(c >> 24));
    aic_writePage(AIC3212_ADC_IIR_FILTER_RIGHT_PAGE, 33, (uint8_t)(c >> 16));
    aic_writePage(AIC3212_ADC_IIR_FILTER_RIGHT_PAGE, 34, (uint8_t)(c >> 8));

    c = coeff[1];
    aic_writePage(AIC3212_ADC_IIR_FILTER_RIGHT_PAGE, 36, (uint8_t)(c >> 24));
    aic_writePage(AIC3212_ADC_IIR_FILTER_RIGHT_PAGE, 37, (uint8_t)(c >> 16));
    aic_writePage(AIC3212_ADC_IIR_FILTER_RIGHT_PAGE, 38, (uint8_t)(c >> 8));

    c = coeff[2];
    aic_writePage(AIC3212_ADC_IIR_FILTER_RIGHT_PAGE, 40, (uint8_t)(c >> 24));
    aic_writePage(AIC3212_ADC_IIR_FILTER_RIGHT_PAGE, 41, (uint8_t)(c >> 16));
    aic_writePage(AIC3212_ADC_IIR_FILTER_RIGHT_PAGE, 42, (uint8_t)(c >> 8));

    aic_goToBook(0);
}

bool ESP32AIC3212::mixInput1toHPout(bool state)
{
    int page = 1;
    int reg;
    uint8_t val;

    aic_goToBook(0);
    for (reg = 12; reg <= 13; reg++)
    { // reg 12 is Left, reg 13 is right
        val = aic_readPage(page, reg);
        if (state == true)
        {                           // activate
            val = val | 0b00000100; // set this bit.  Route IN1L to HPL
        }
        else
        {
            val = val & 0b11111011; // clear this bit.  Un-do routing of IN1L to HPL
        }
        aic_writePage(page, reg, val);
    }
    return state;
}

// ============================================================================
// Digital Microphone Configuration
// Configure PDM digital microphone on DIN2/BCLK2 pins
// ============================================================================
bool ESP32AIC3212::configureDigitalMicOnDIN2(void) {
    if (debugToSerial) Serial.println("ESP32AIC3212: Configuring codec for digital microphone...");

    // ============================================================================
    // IMPORTANT: Do NOT write P0_R27 or P0_R28 here!
    // These are aliases for P4_R1 and P4_R2 which were already configured by
    // aic_init(). Writing to them will overwrite the I2S format and clock settings.
    // ============================================================================

    // IMPORTANT: Do NOT overwrite clock configuration here!
    // P0_R4 (clock source), P0_R18 (NADC), P0_R19 (MADC), P0_R20 (AOSR), and
    // P0_R61 (PRB_R) are already configured by aic_init() from DefaultConfig.
    // These values are carefully calculated to satisfy the PRB_R7 RC constraint:
    //   MADC × AOSR / 32 = RC (must be ≥23 for PRB_R7)
    //
    // DefaultConfig sets:
    //   - PLL enabled: 3.072 MHz (BCLK1) → 36.864 MHz (PLL_CLK)
    //   - ADC uses PLL_CLK, DAC uses PLL_CLK
    //   - NADC=1, MADC=12, AOSR=64, PRB_R=7 (Filter B - full audio bandwidth 0-21.6kHz)
    //   - ADC_MOD_CLK = 36.864 MHz / (1 × 12) = 3.072 MHz (optimal for CMM-3424DT) ✓
    //   - Sample rate = 36.864 MHz / (1 × 12 × 64) = 48 kHz ✓
    //   - RC constraint = 12 × 64 / 32 = 24 (PRB_R7 needs ≥23) ✓
    //   - Digital volume at +20dB (maximum) to compensate for PDM mic's -26dBFS sensitivity

