schplay/ESP32-AIC3212/src/ESP32_AIC3212.cpp
    // Power down ADC briefly to allow IIR coefficient writes
    aic_writePage(0, 0x51, 0x00);  // Power down both ADC channels
    delay(5);

    // ============================================================================
    // OPTIONAL: Configure 1st Order IIR as High-Pass Filter to Remove DC Offset
    // PDM digital microphones can produce DC offset in their output
    // The 1st-order IIR in PRB_R7 can be programmed as HPF to remove DC if needed
    //
    // Signal path: PDM → Decimation Filter → 1st Order IIR → AGC → Volume → Output
    //
    // NOTE: Initially DISABLED to verify if DC offset is actually present.
    // Enable only if measurements show significant DC component in output.
    // Unnecessary filtering can add noise and reduce dynamic range.
    //
    // Transfer function: H(z) = (N0 + N1*z^-1) / (1 - D1*z^-1)
    // High-pass filter coefficients for 20Hz cutoff @ 48kHz sample rate:
    // N0 (C36) = 0x7FC000 (+0.9974)
    // N1 (C37) = 0x804000 (-0.9974, 2's complement)
    // D1 (C39) = 0x7F8000 (+0.9948)
    // ============================================================================

    // ENABLED: High-pass filter to remove DC offset from PDM microphone
    // 20Hz cutoff @ 48kHz sample rate removes DC while preserving voice (>80Hz)
    uint32_t hpfCoeff[3];
    hpfCoeff[0] = 0x7FC00000;  // N0 = 0x7FC000 (shifted left 8 bits)
    hpfCoeff[1] = 0x80400000;  // N1 = 0x804000 (shifted left 8 bits)
    hpfCoeff[2] = 0x7F800000;  // D1 = 0x7F8000 (shifted left 8 bits)
    setHpfIIRCoeffOnADC(Right_Chan, hpfCoeff);

    if (debugToSerial) {
        Serial.println("ESP32AIC3212: HPF ENABLED - 20Hz high-pass removes DC offset");
    }

    // NOTE: P1_R8 common mode voltage is already configured by aic_init()
    // User has it set to 0x1B (Input CM=0.9V for 1.8V AVDD, Output CM=1.65V)
    // Do NOT modify P1_R8 here as it will break the correct configuration

    // ============================================================================
    // CRITICAL: Bypass Analog PGA - Route Digital Microphone Directly to ADC Modulator
    // SLAU360 B0_P1_R61 Bit D2: Route RIGHT ADC Modulator input directly from pin
    // This bypasses the entire analog PGA path, preventing analog circuitry from
    // processing the PDM bitstream which causes decimation filter saturation.
    //
    // ROOT CAUSE OF OVERFLOW: Without this, PDM bitstream flows through:
    //   1. Analog input pins (treat PDM as analog voltage swings)
    //   2. Analog PGA amplifier (processes PDM transitions as "analog signal")
    //   3. ADC delta-sigma modulator (receives already-digital PDM as "analog" input)
    //   4. CIC decimation filter accumulator integrates PDM → OVERFLOW
    //
    // This is why digital volume control doesn't prevent overflow - it's applied
    // AFTER the decimation filter where overflow occurs.
    // ============================================================================

    // Read current PTM setting (bits 7:6) configured by aic_init()
    uint8_t p1_r61_current = aic_readPage(1, 0x3D);
    uint8_t ptm_bits = p1_r61_current & 0xC0;  // Preserve PTM_R setting (bits 7:6)

    // Set bit D2=1 to route RIGHT ADC Modulator input directly from DIN2 pin
    // This bypasses the analog PGA completely for digital microphone mode
    aic_writePage(1, 0x3D, ptm_bits | 0x04);  // PTM setting + bit D2 set

    if (debugToSerial) {
        Serial.println("ESP32AIC3212: Configured P1_R61 to bypass analog PGA for digital mic");
        Serial.printf("  Previous value: 0x%02X, New value: 0x%02X\n", p1_r61_current, ptm_bits | 0x04);
    }

    // ============================================================================
    // Disable Analog Input Routing to RIGHT PGA
    // Even though we've bypassed the PGA with P1_R61_D2, explicitly disable
    // analog input routing to ensure no analog signals interfere with digital path
    // ============================================================================

    aic_writePage(1, 0x37, 0x00);  // P1_R55: Disable all inputs to RIGHT PGA P-terminal
    aic_writePage(1, 0x39, 0x00);  // P1_R57: Disable all inputs to RIGHT PGA M-terminal
    aic_writePage(1, 0x3C, 0x80);  // P1_R60: RIGHT PGA gain disabled (muted)

    // Power down mixer amplifiers (not used for digital microphone)
    aic_writePage(1, 0x11, 0x00);  // P1_R17: Power down MAL and MAR

    if (debugToSerial) {
        Serial.println("ESP32AIC3212: Disabled analog input routing and powered down mixers");
    }

    // NOTE: For PDM microphones, we DON'T use ASI2 BCLK/WCLK generation
    // Instead, we output ADC_MOD_CLK directly from the BCLK2 pin
    // ADC_MOD_CLK = 1.536 MHz (calculated above with MADC=2)

    // P4 R70: BCLK2 Pin Control - Configure BCLK2 to output ADC_MOD_CLK for PDM mic
    // Bits [5:3] = 101 (0x28 >> 3 = 5) outputs ADC_MOD_CLK as PDM_CLK
    // This outputs 1.536 MHz clock to the CMM-3424DT microphone (within 1.0-4.8 MHz spec)
    aic_writePage(4, 0x46, 0x28);  // BCLK2 pin = ADC_MOD_CLK output @ 1.536 MHz

    // P4 R72: DIN2 Pin Control - Enable DIN2 as digital audio input
    aic_writePage(4, 0x48, 0x20);  // Enable DIN2 (bit 5 = 1)

    // P4 R101: Digital Microphone Input Configuration
    // NOTE: Reverting to original 0x03 - P0_R81 bit 3 controls ADC edge detection
    // P4_R101 may only affect ASI2 routing, not ADC sampling
    // 0x03 = 0b00000011 - bits[3:2]=00, bits[1:0]=11
    aic_writePage(4, 0x65, 0x03);  // DIN2: Original configuration

    // ============================================================================
    // CRITICAL: P4_R7 must be set to route ADC data to ASI1 DOUT
    // P4_R7 bits [2:0] control ASI1 data source:
    //   000: ASI1 output disabled (tri-stated)
    //   001: ASI1 sourced from ADC Data Output ← NEEDED FOR RECORDING
    //   010: ASI1-to-ASI1 loopback (set by aic_init for playback)
    //   011: ASI2-to-ASI1 loopback
    //
    // aic_init() sets P4_R7 = 0x02 for playback (ASI1→ASI1→DAC).
    // For recording, we need 0x01 to route ADC→ASI1 DOUT.
    // Without this, ADC FIFO overflows (P0_R42 = 0x0E) because data has nowhere to go.
    // ============================================================================
    aic_writePage(4, 0x07, 0x01);  // P4_R7: ASI1 sourced from ADC output

    // ============================================================================
    // CRITICAL: Enable ADC and DAC Clock Domain Synchronization with ASI1
    // P4_R119 bits [7:6] control DAC engine synchronization:
    //   00: Enable DAC syncing with ASI1
    //   01: Enable DAC syncing with ASI2
    //   10: Enable DAC syncing with ASI3
    //   11: Disable DAC syncing
    // P4_R119 bits [5:4] control ADC engine synchronization:
    //   00: Enable ADC syncing with ASI1 (REQUIRED for ADC→ASI1 routing)
    //   01: Enable ADC syncing with ASI2
    //   10: Enable ADC syncing with ASI3
    //   11: Disable ADC syncing (default - causes overflow!)
    //
    // CRITICAL: Digital microphone PDM decimation filter requires frame sync from ASI1
    // Expert analysis: P4_R119 bits[5:4]=11 (internal timing) causes overflow with
    // digital mic mode because PDM decimation FIFO fills faster than ASI1 reads it.
    // Digital mic mode specifically needs ASI1 synchronization for proper timing.
    // ============================================================================
    aic_writePage(4, 0x77, 0x00);  // P4_R119: Both DAC and ADC sync with ASI1
                                    // 0x00 = bits [7:6]=00 (DAC syncs with ASI1)
                                    //        bits [5:4]=00 (ADC syncs with ASI1)

    // P0 R81: ADC Channel Power Control
    // Bit D6 = 1: RIGHT ADC powered up
    // Bits D5-D4 = 00: LEFT digital mic mode DISABLED (no mic on LEFT channel)
    // Bits D3-D2 = 01: RIGHT digital mic mode ENABLED (mic on RIGHT channel)
    // Expert: Only enable digital mic mode on channel that has microphone connected
    // With PRB_R7, MADC=12, AOSR=64: ADC_MOD_CLK = 3.072 MHz (optimal for CMM-3424DT)
    aic_writePage(0, 0x51, 0x44);  // 0b01000100 - RIGHT ADC power + RIGHT digital mic only

    // P0 R82: ADC Fine Gain - Mute LEFT (unused), Unmute RIGHT (valid data)
    // Bit 7 = LEFT mute, Bit 3 = RIGHT mute
    aic_writePage(0, 0x52, 0x80);  // Mute LEFT (0x80), Unmute RIGHT (0x00)

    // P0 R83: Left ADC Volume Control - muted anyway, set to 0dB
    aic_writePage(0, 0x53, 0x00);  // 0dB (LEFT channel not used)

    // P0 R84: Right ADC Volume Control
    // CRITICAL: PDM microphones output -26dBFS at 94dB SPL (normal speech level)
    // At 0dB digital gain, output is only ±550-±1900 counts (1.7-5.8% of full scale)
    // This is NORMAL and expected. We need to ADD digital gain for proper output level.
    // Range per datasheet (slau360.txt): -12dB to +20dB in 0.5dB steps
    //   0x00 = 0dB (default)
    //   0x18 = +12dB (24 steps × 0.5dB)
    //   0x28 = +20dB (40 steps × 0.5dB, maximum gain)
    //   0x68 = -12dB (maximum attenuation)
    // Start with +20dB (maximum gain) to bring -26dBFS mic output to -6dBFS
    aic_writePage(0, 0x54, 0x28);  // digital VOLUME

