schplay/ESP32-AIC3212/src/ESP32_AIC3212.cpp
    delay(10);  // Allow configuration to settle

    // Explicitly clear ADC overflow flags by writing to P0_R42
    // Bit 2 = RIGHT ADC overflow (write 1 to clear)
    uint8_t overflow_flags = aic_readPage(0, 0x42);  // Read current flags
    if (overflow_flags != 0) {
        aic_writePage(0, 0x42, overflow_flags);  // Write back to clear
        if (debugToSerial) {
            Serial.printf("ESP32AIC3212: Cleared ADC overflow flags: 0x%02X\n", overflow_flags);
        }
        delay(5);
    }

    // Verify critical registers
    uint8_t p0_r4 = aic_readPage(0, 4);
    uint8_t p0_r18 = aic_readPage(0, 0x12);  // NADC
    uint8_t p0_r19 = aic_readPage(0, 0x13);  // MADC
    uint8_t p0_r20 = aic_readPage(0, 0x14);  // AOSR
    uint8_t p0_r51 = aic_readPage(0, 0x51);  // ADC Power
    uint8_t p0_r61 = aic_readPage(0, 0x3D);  // PRB_R
    uint8_t p0_r84 = aic_readPage(0, 0x54);  // RIGHT ADC Volume
    uint8_t p4_r1 = aic_readPage(4, 0x01);   // ASI1 Format
    uint8_t p4_r7 = aic_readPage(4, 0x07);   // ASI1→DAC routing
    uint8_t p4_r10 = aic_readPage(4, 0x0A);  // ASI1 Clock direction
    uint8_t p4_r70 = aic_readPage(4, 0x46);  // BCLK2
    uint8_t p4_r72 = aic_readPage(4, 0x48);  // DIN2
    uint8_t p4_r101 = aic_readPage(4, 0x65); // Digital Mic Config
    uint8_t p4_r119 = aic_readPage(4, 0x77); // ADC/DAC Sync

    if (debugToSerial) {
        Serial.println("\n=== Digital Microphone Register Verification ===");
        Serial.println("--- Clock Configuration (PLL-Based for PRB_R7 with Filter B) ---");
        Serial.printf("  P0_R4 (Clock Source): 0x%02X (expected 0x33 - DAC:PLL_CLK, ADC:PLL_CLK)\n", p0_r4);
        Serial.printf("  P0_R18 (NADC): 0x%02X (expected 0x81 - Enabled, divider=1)\n", p0_r18);
        Serial.printf("  P0_R19 (MADC): 0x%02X (expected 0x8C - Enabled, divider=12)\n", p0_r19);
        Serial.printf("  P0_R20 (AOSR): 0x%02X (expected 0x40 - Oversampling=64)\n", p0_r20);

        // Calculate and display actual clock frequencies
        uint8_t nadc_val = p0_r18 & 0x7F;
        uint8_t madc_val = p0_r19 & 0x7F;
        uint8_t aosr_val = p0_r20;
        float pll_clk = 36.864;  // MHz (from PLL: 3.072 * 12)
        float adc_mod_clk = pll_clk / (nadc_val * madc_val);
        float adc_fs = pll_clk * 1000000.0 / (nadc_val * madc_val * aosr_val);
        float rc_check = (madc_val * aosr_val) / 32.0;

        Serial.printf("  PLL_CLK = %.3f MHz (from BCLK1 3.072MHz * 12)\n", pll_clk);
        Serial.printf("  ADC_MOD_CLK = %.3f MHz (optimal for CMM-3424DT: 1.0-4.8 MHz)\n", adc_mod_clk);
        Serial.printf("  ADC Sample Rate = %.0f Hz\n", adc_fs);
        Serial.printf("  RC Constraint Check: MADC*AOSR/32 = %d*%d/32 = %.1f (PRB_R7 needs ≥23)\n",
                      madc_val, aosr_val, rc_check);

        Serial.println("\n--- ASI1 Configuration ---");
        Serial.printf("  P4_R1 (ASI1 Format): 0x%02X (should be 0x00 for 16-bit I2S)\n", p4_r1);
        Serial.printf("  P4_R10 (ASI1 Clock): 0x%02X (should be 0x00 - Slave mode)\n", p4_r10);
        Serial.printf("  P4_R7 (ASI1 Source): 0x%02X (expected 0x01 - ADC→ASI1 DOUT)\n", p4_r7);
        Serial.printf("  P4_R119 (ADC/DAC Sync): 0x%02X (expected 0x00 - ADC and DAC sync ASI1)\n", p4_r119);

        Serial.println("\n--- ADC Configuration ---");
        Serial.printf("  P0_R61 (PRB_R): 0x%02X (expected 0x07 - PRB_R7 Decimation Filter B)\n", p0_r61);
        Serial.printf("  P0_R81 (ADC Power): 0x%02X (expected 0x44 - RIGHT ADC + RIGHT digital mic only)\n", p0_r51);

        Serial.println("\n--- PDM Microphone Configuration ---");
        Serial.printf("  P4_R70 (BCLK2 Pin): 0x%02X (wrote 0x28 for ADC_MOD_CLK output @ 3.072MHz)\n", p4_r70);
        Serial.printf("  P4_R72 (DIN2 Pin): 0x%02X (wrote 0x20 to enable DIN2, extra bits are status)\n", p4_r72);
        Serial.printf("  P4_R101 (Digital Mic): 0x%02X (expected 0x03 - RIGHT on DIN2 falling edge)\n", p4_r101);
        Serial.printf("  P0_R84 (RIGHT Vol): 0x%02X (expected 0x28 - +20dB maximum gain)\n", p0_r84);

        // Verify analog PGA bypass configuration (CRITICAL for preventing overflow)
        uint8_t p1_r61 = aic_readPage(1, 0x3D);
        uint8_t p1_r55 = aic_readPage(1, 0x37);
        uint8_t p1_r57 = aic_readPage(1, 0x39);
        uint8_t p1_r60 = aic_readPage(1, 0x3C);

        Serial.println("\n--- Analog PGA Bypass Configuration (Critical for Overflow Prevention) ---");
        Serial.printf("  P1_R61 (ADC PTM): 0x%02X (bit 2=%d, MUST be 1 for RIGHT bypass)\n",
                      p1_r61, (p1_r61 >> 2) & 0x01);
        Serial.printf("  P1_R55 (RIGHT PGA P-inputs): 0x%02X (should be 0x00 - all disabled)\n", p1_r55);
        Serial.printf("  P1_R57 (RIGHT PGA M-inputs): 0x%02X (should be 0x00 - all disabled)\n", p1_r57);
        Serial.printf("  P1_R60 (RIGHT PGA Control): 0x%02X (bit 7=%d, should be 1 for disabled)\n",
                      p1_r60, (p1_r60 >> 7) & 0x01);

        // Calculate and display ADC_CLK / Sample Rate / PDM Clock
        uint8_t nadc = p0_r18 & 0x7F;
        uint8_t madc = p0_r19 & 0x7F;
        uint8_t aosr = p0_r20;

        // Determine ADC clock source from P0_R4
        uint8_t adc_clk_src = p0_r4 & 0x0F;
        float adc_clkin_mhz;
        const char* clk_src_name;

        if (adc_clk_src == 0x03) {  // PLL_CLK
            adc_clkin_mhz = 19.968f;  // PLL output: 3.072 MHz * 6.5
            clk_src_name = "PLL_CLK";
        } else if (adc_clk_src == 0x01) {  // BCLK1
            adc_clkin_mhz = 3.072f;
            clk_src_name = "BCLK1";
        } else {
            adc_clkin_mhz = 0.0f;
            clk_src_name = "UNKNOWN";
        }

        float adc_mod_clk_mhz = adc_clkin_mhz / (nadc * madc);  // ADC_CLKIN / (NADC * MADC)
        float sample_rate_khz = (adc_clkin_mhz * 1000.0f) / (nadc * madc * aosr);

        Serial.printf("\n--- Calculated Frequencies ---");
        Serial.printf("\n  ADC_CLKIN: %.3f MHz (from %s)\n", adc_clkin_mhz, clk_src_name);
        Serial.printf("  ADC_MOD_CLK (PDM_CLK): %.3f MHz (ADC_CLKIN / (NADC=%d * MADC=%d))\n", adc_mod_clk_mhz, nadc, madc);
        Serial.printf("  ADC Sample Rate: %.1f kHz (%.3fMHz / (NADC=%d * MADC=%d * AOSR=%d))\n",
                      sample_rate_khz, adc_clkin_mhz, nadc, madc, aosr);
        Serial.printf("  CMM-3424DT-26165-TR valid ranges: 0.35-0.8 MHz, 1.0-2.475 MHz, or 3.0-4.8 MHz\n");

        bool in_spec = (adc_mod_clk_mhz >= 0.35 && adc_mod_clk_mhz <= 0.8) ||
                       (adc_mod_clk_mhz >= 1.0 && adc_mod_clk_mhz <= 2.475) ||
                       (adc_mod_clk_mhz >= 3.0 && adc_mod_clk_mhz <= 4.8);

