schplay/ESP32-AIC3212/src/ESP32_AIC3212.cpp
        if (!in_spec) {
            Serial.printf("  WARNING: PDM clock %.3f MHz is OUT OF SPEC!\n", adc_mod_clk_mhz);
        } else {
            Serial.printf("  PDM clock is within spec ✓\n");
        }
        Serial.printf("  IMPORTANT: If sample rate != 48.0 kHz, check MADC value!\n");
        Serial.println("\n=== Configuration Complete ===");
    }

    return true;
}

// ============================================================================
// Digital Microphone Diagnostic
// Comprehensive diagnostic output for debugging digital microphone setup
// ============================================================================
void ESP32AIC3212::diagnosticDigitalMic(void) {
    Serial.println("\n========== DIGITAL MICROPHONE DIAGNOSTIC ==========");

    // === Clock Configuration ===
    Serial.println("\n--- Clock Configuration ---");
    Serial.printf("P0_R4 (Clock Src): 0x%02X\n", aic_readPage(0, 4));
    Serial.printf("P0_R11 (NDAC): 0x%02X\n", aic_readPage(0, 0x0B));
    Serial.printf("P0_R12 (MDAC): 0x%02X\n", aic_readPage(0, 0x0C));
    Serial.printf("P0_R18 (NADC): 0x%02X\n", aic_readPage(0, 0x12));
    Serial.printf("P0_R19 (MADC): 0x%02X\n", aic_readPage(0, 0x13));
    Serial.printf("P0_R20 (AOSR): 0x%02X\n", aic_readPage(0, 0x14));

    // === ASI2 Clock Generation ===
    Serial.println("\n--- ASI2 Clock Generation ---");
    Serial.printf("P4_R39 (ASI2 BCLK Src): 0x%02X\n", aic_readPage(4, 0x27));
    Serial.printf("P4_R40 (ASI2 BCLK Div): 0x%02X\n", aic_readPage(4, 0x28));
    Serial.printf("P4_R42 (ASI2 WCLK Div): 0x%02X\n", aic_readPage(4, 0x2A));
    Serial.printf("P4_R26 (ASI2 CLK Out): 0x%02X\n", aic_readPage(4, 0x1A));

    // === ASI1 Configuration ===
    Serial.println("\n--- ASI1 (Output to MCU) Configuration ---");
    Serial.printf("P4_R1 (ASI1 Format): 0x%02X\n", aic_readPage(4, 0x01));
    Serial.printf("P4_R2 (ASI1 Offset): 0x%02X\n", aic_readPage(4, 0x02));
    Serial.printf("P4_R7 (ASI1 Input): 0x%02X\n", aic_readPage(4, 0x07));
    Serial.printf("P4_R8 (ASI1->DAC): 0x%02X\n", aic_readPage(4, 0x08));
    Serial.printf("P4_R10 (ASI1 CLK): 0x%02X\n", aic_readPage(4, 0x0A));
    Serial.printf("P4_R119 (ADC/DAC Sync): 0x%02X\n", aic_readPage(4, 0x77));

    // === ASI2 Configuration ===
    Serial.println("\n--- ASI2 (Input from Mic) Configuration ---");
    Serial.printf("P4_R23 (ASI2 Format): 0x%02X\n", aic_readPage(4, 0x17));
    Serial.printf("P4_R24 (ASI2 Offset): 0x%02X\n", aic_readPage(4, 0x18));

    // === Pin Configuration ===
    Serial.println("\n--- Pin Configuration ---");
    Serial.printf("P4_R68 (DIN1): 0x%02X\n", aic_readPage(4, 0x44));
    Serial.printf("P4_R70 (BCLK2): 0x%02X\n", aic_readPage(4, 0x46));
    Serial.printf("P4_R72 (DIN2): 0x%02X\n", aic_readPage(4, 0x48));
    Serial.printf("P4_R101 (DigMic): 0x%02X\n", aic_readPage(4, 0x65));

    // === ADC Configuration ===
    Serial.println("\n--- ADC Configuration ---");
    Serial.printf("P0_R60 (ADC PRB): 0x%02X\n", aic_readPage(0, 0x3C));  // Should show PRB
    Serial.printf("P0_R61 (ADC PRB): 0x%02X\n", aic_readPage(0, 0x3D));
    Serial.printf("P0_R81 (ADC Power): 0x%02X\n", aic_readPage(0, 0x51));
    Serial.printf("P0_R82 (ADC Mute): 0x%02X\n", aic_readPage(0, 0x52));
    Serial.printf("P0_R83 (ADC Vol L): 0x%02X\n", aic_readPage(0, 0x53));
    Serial.printf("P0_R84 (ADC Vol R): 0x%02X\n", aic_readPage(0, 0x54));

    // === ADC Flag Registers (Status) ===
    Serial.println("\n--- ADC Status Flags ---");
    Serial.printf("P0_R36 (ADC Flag): 0x%02X\n", aic_readPage(0, 0x24));
    Serial.printf("P0_R37 (ADC Flag): 0x%02X\n", aic_readPage(0, 0x25));
    Serial.printf("P0_R42 (ADC Flag): 0x%02X\n", aic_readPage(0, 0x2A));

    Serial.println("\n===================================================\n");
}

// ============================================================================
// Set codec to recording mode (ADC→ASI1)
// P4_R7 = 0x01: Route ADC data to ASI1 DOUT for recording
// This must be called before starting audio recording
// ============================================================================
bool ESP32AIC3212::setRecordingMode(void) {
    if (debugToSerial) Serial.println("ESP32AIC3212: Setting recording mode (ADC→ASI1)");
    return aic_writePage(4, 0x07, 0x01);  // P4_R7: ASI1 sourced from ADC output
}

// ============================================================================
// Set codec to playback mode (ASI1-to-ASI1 loopback)
// P4_R7 = 0x02: ASI1-to-ASI1 loopback, routes I2S→DAC→Speaker
// This must be called before starting audio playback
// ============================================================================
bool ESP32AIC3212::setPlaybackMode(void) {
    if (debugToSerial) Serial.println("ESP32AIC3212: Setting playback mode (ASI1→DAC)");
    return aic_writePage(4, 0x07, 0x02);  // P4_R7: ASI1-to-ASI1 loopback
}

} // namespace esp32aic3212